000001 IDENTIFICATION DIVISION.
000002 PROGRAM-ID. NYFPOWFP.
000003 AUTHOR. BHARATH.
000004 DATE-WRITTEN. 02/2020.
000005 ENVIRONMENT DIVISION.
000006 CONFIGURATION SECTION.
000007 INPUT-OUTPUT SECTION.
000008 FILE-CONTROL.
000009 DATA DIVISION.
000010 FILE SECTION.
000011
000012 ******************************************************************
000013 *
000014 *A      ABSTRACT..
000015 *  FILEPASS IS NEEDED FOR SEC REQUEST.
000016 *
000017 *J      JCL..
000018 *
000019 *//NYF708VA EXEC PGM=NYF708VA,TIME=30,REGION=8M
000020 *//SEQUEN1  DD DISP=(,CATLG),
000021 *//             UNIT=TEMP,SPACE=(CYL,(20,20),RLSE),
000022 *//             DCB=(RECFM=FB,LRECL=400,BLKSIZE=0),
000023 *//             DSN=T54.NYF708VA.PROD.DATA
000024 *//VSAM2   DD DISP=SHR,DSN=P54.CK.BASEB.POLICY
000025 *//FVDSEG1 DD DISP=SHR,DSN=P54.CK.BASEB.AUXSEG1
000026 *//FVDULHD DD DISP=SHR,DSN=P54.CK.BASEB.HISTORY
000027 *//FVDSEGH DD DISP=SHR,DSN=P54.CK.BASEB.AUXSEGH
000028 *//SYSOUT  DD SYSOUT=*
000029 *//SYSABEND DD SYSOUT=*
000030 *//ABNLDUMP DD DUMMY
000031 *//SYSDUMP DD SYSOUT=*
000032 *//SYSUDUMP DD SYSOUT=*
000033 *
000034 *P      ENTRY PARAMETERS..
000035 *       NONE.
000036 *
000037 *E      ERRORS DETECTED BY THIS ELEMENT..
000038 *       I/O ERROR ON FILES
000039 *
000040 *C      ELEMENTS INVOKED BY THIS ELEMENT..
000041 *
000042 *       CKVSAMIO ---- VSAM I/O INTERFACE
000043 *       CKABEND  ---- FORCE A PROGRAM INTERUPT
000044 *       CKETRLST ---- TRAILER LIST ELEMENT
000045 *       CKETRGET ---- TRAILER GET  ELEMENT
000046 *       CKSDT1IO ---- AUX SEGMENT TABLE INTERFACE
000047 *       CKSDTXIO ---- AUXH SEGMENT TABLE INTERFACE
000048 *       CKUBHSIO ---- HISTORY FILE I/O
000049 *       CKSETADR ---- SET ADDRESS
000050 *       CKCOOCRD ---- PRINT ELEMENT
000051 *       CKDCEXIN ---- DATE CONVERSION
000052 *       CKBITBYT ---- BIT TO BYTE CONVERSION
000053 *       CKDCINEX ---- DATE CONVERSION
000054 *       CKBATCHC ---- SEQUENTIAL FILE I/O
000055 *
000056 *U      USER CONSTANTS AND TABLES REFERENCED..
000057 *       NONE
000058 *
000059 *//
000060 *
000061 ******************************************************************
000062 ******************************************************************
000063
000064 EJECT
000065 WORKING-STORAGE SECTION.
000066 01 FILLER                     PIC X(32)
000067    VALUE 'NYF708VA WORKING STORAGE BEGINS '.
000068 ******************************************************************
000069 *                         D A T A   A R E A S
000070 ******************************************************************
000071 COPY CKRECMAX.
000072 EJECT
000073 ******************************************************************
000074 *                   R E A D   O N L Y   C O N S T A N T S
000075 ******************************************************************
000076 01 READ-ONLY-WORK-AREA.
000077    05 HWORD        COMP PIC S9(04) VALUE +7.
000078    05 BINARY-3     COMP PIC S9(04) VALUE +3.
000079    05 BINARY-7     COMP PIC S9(04) VALUE +7.
000080    05 WS-DUMMY          PIC X VALUE SPACE.
000081    05 MISC-CONSTANTS.
000082       10 CONSTANT-89    PIC S9(4) VALUE +089 COMP.
000083       10 WS-HEX-VALUES  PIC S9(13) COMP-3
000084                          VALUE +0001020304050.
000085       10 WS-HEX-TABLE REDEFINES WS-HEX-VALUES.
000086          15 HEX-00      PIC X.
000087          15 HEX-01      PIC X.
000088          15 HEX-HI-02   PIC X.
000089          15 HEX-03      PIC X.
000090          15 HEX-04      PIC X.
000091          15 HEX-05      PIC X.
000092          15 FILLER      PIC X.
000093    05 WS-OTHER-DUMMY    PIC X VALUE SPACE.
000094    05 BINARY1      COMP PIC S9(04) VALUE +1.
000095
000096    05 INFORCE-VSAM       PIC X(8) VALUE 'VSAM2'.
000097    05 HISTORY-VSAM       PIC X(8) VALUE 'VSAMX'.
000098    05 ACF-FILE-NAME      PIC X(8) VALUE 'VSAM3'.
000099    05 MSG01-IO-ERROR     PIC X(19)
000100       VALUE 'I/O ERROR ON FILE -'.
000101
000102 * SWITCHES AREA
000103 ***NYRBNFOR TABLE AREA
000104    05 END-OF-FILE-INDICATOR  PIC X(1).
000105       88 END-OF-FILE          VALUE 'Y'.
000106    05 RIDER-IND               PIC X(1).
000107       88 RIDER-FOUND          VALUE 'Y'.
000108    05 WS-RECORD-IND           PIC X(1).
000109       88 INFORCE-RECORD       VALUE 'I'.
000110    05 CONTINUE-PROCESSING-INDICATOR PIC X(1).
000111       88 CONTINUE-PROCESSING  VALUE 'Y'.
000112       88 END-OF-PROCESSING    VALUE 'N'.
000113    05 RMD-PPW-IND             PIC X(1).
000114       88 RMD-PPW              VALUE 'Y'.
000115    05 AWD-TRANS-IND           PIC X(1).
000116       88 AWD-TRANS-FOUND      VALUE 'Y'.
000117       88 AWD-TRANS-NOT-FOUND  VALUE 'N'.
000118    05 END-OF-TABLE-INDICATOR    PIC X(1).
000119       88 END-OF-TABLE            VALUE 'Y'.
000120       88 CONTINUE-LOADING        VALUE 'N'.
000121    05 PREM-TRANS-IND             PIC X(1).
000122       88 PREMS-FOUND             VALUE 'Y'.
000123       88 PREMS-NOT-FOUND         VALUE 'N'.

000124    05 WS-EFT-FOUND               PIC X(01).
000125       88 EFT-FOUND               VALUE 'Y'.
000126       88 EFT-NOT-FOUND           VALUE 'N'.

000127    05 MNTHLY-PORCESS-IND         PIC X(1).
000128       88 MNTHLY-YET-PROCESS      VALUE 'Y'.

000129    05 SEMIANNUAL-PORCESS-IND     PIC X(1).
000130       88 SEMIANNUAL-YET-PROCESS  VALUE 'Y'.

000131    05 ANNUAL-PORCESS-IND         PIC X(1).
000132       88 ANNUAL-YET-PROCESS      VALUE 'Y'.

000133    05 PPW-IND                    PIC X(01).
000134       88 PPW-QUALIFY             VALUE 'Y'.
000135       88 PPW-NOT-QUALIFY         VALUE 'N'.

000136    05 ADDL-PREM-IND              PIC X(1).
000137       88 ADDL-PREM-MADE          VALUE 'Y'.
000138       88 ADDL-PREM-NOT-MADE      VALUE 'N'.

000139    05 WS-NP-ACTIVE-FUND-SW       PIC X(01).
000140       88 WS-NP-ACTIVE-FUND-NO    VALUE 'N'.
000141       88 WS-NP-ACTIVE-FUND-YES   VALUE 'Y'.

000142    05 PPW-STATUS-IND             PIC X(1).
000143       88 PPW-FOUND               VALUE 'Y'.
000144       88 PPW-NOT-FOUND           VALUE 'N'.

000145    05 WS-PPW-IND                 PIC X(1).
000146       88 PPW-FND                 VALUE 'Y'.
000147       88 PPW-N-FND               VALUE 'N'.

000148    05 CT-STATE-IND               PIC X(1).
000149       88 CT-STATE-FOUND          VALUE 'Y'.
000150       88 CT-STATE-NOT-FOUND      VALUE 'N'.

000151    05 MAT-DT-CHECK-IND           PIC X(1).
000152       88 MAT-DATE-FOUND          VALUE 'Y'.
000153       88 MAT-DATE-NOT-FOUND      VALUE 'N'.

000154    05 GFIR-IND                   PIC X(1).
000155       88 GFIR-IND-FOUND          VALUE 'Y'.
000156       88 GFIR-IND-NOT-FOUND      VALUE 'N'.

000157    05 NEW-MAT-DT-IND             PIC X(1).
000158       88 NEW-MAT-DT-FOUND        VALUE 'Y'.
000159       88 NEW-MAT-DT-NOT-FOUND    VALUE 'N'.

000160    05 WSP-RIDER-IND              PIC X(1).
000161       88 WSP-IND-FOUND           VALUE 'Y'.
000162       88 WSP-IND-NOT-FOUND       VALUE 'N'.

000163    05 WS-FILE-IND                PIC X(1).
000164       88 INFORCE-FILE            VALUE 'I'.
000165       88 HISTORY-FILE            VALUE 'H'.

000166    05 WS-SAVE-PLAN               PIC X(11).
000167 *  05 WS-TEMP-POLICY             PIC X(10).

000168    05 CHECK-TRANS-TYPE           PIC X(02).
000169       88 PRTL-WTHDRL             VALUES
000170            'SH','SN','SG','SM',
000171            'SA','SV','SW','ST'.

000172    05 PRTL-WDRWL-IND             PIC X(01).
000173       88 PRTL-WTHDRL-FOUND       VALUES 'Y'.
000174       88 PRTL-WTHDRL-NOT-FOUND   VALUES 'N'.

000175    05 CHECK-TRANS-COUNT          PIC X(02).
000176       88 FULL-SURRENDER          VALUES 'SF'.
000177       88 TERM-DEATH              VALUES 'TD'.
000178       88 INIT-PAYMENT            VALUES 'PI','PF'.
000179       88 ALL-PREM-PAYMENT        VALUES
000180            'PI','PF','PA','PR',
000181            'PT','PU','PB'.
000182       88 ADDTL-PAYMENT           VALUES 'PA'.
000183       88 REG-PAYMENT             VALUES 'PR'.
000184       88 REINST-PAYMENT          VALUES 'PU','PB'.
000185       88 LOAN-PAYMENT            VALUES 'LN','LM','LG'.

000186    05 SURR-DEATH-TERM-IND        PIC X(01).
000187       88 IS-SURRENDER            VALUES 'S'.
000188       88 IS-TERM-DEATH           VALUES 'T'.
000189       88 UNKNOWN                 VALUES ' '.

000190 *  05 POLICY-FOUND-IND           PIC X(01).
000191 *     88 POLICY-FOUND            VALUES 'Y'.
000192 *     88 POLICY-NOT-FOUND        VALUES 'N'.

000193    05 CHECK-CURR-STATE           PIC X(02).

000194 *  05 PROCESS-POLICY-IND         PIC X(01).
000195 *     88 PROCESS-POLICY          VALUES 'Y'.
000196 *     88 DO-NOT-PROCESS          VALUES 'N'.

000197 *  05 PROCESS-POLICY-IND         PIC X(01).
000198 *     88 WRITE-RECORD            VALUES 'Y'.
000199 *     88 DONT-WRITE-RECORD       VALUES 'N'.

000200 * I-O READ ONLY DATA
000201    05 WS-IO-CODE                 PIC X(1).
000202       88 OPEN-INFORCE-FOR-UPDATE VALUE '1'.
000203       88 CLOSE-INFORCE-FILE      VALUE '5'.
000204       88 SETL-INFORCE-FILE       VALUE '7'.
000205       88 READ-INFORCE-FOR-UPDATE VALUE '8'.
000206       88 REWRITE-INFORCE-FILE    VALUE '4'.
000207       88 INFORCE-IO-COMPLETED    VALUE '0'.
000208       88 INFORCE-IO-EOF          VALUE '6'.
000209       88 INFORCE-IO-FAILED       VALUE '1' THRU '5'
000210                                     '7' THRU '9'.

000211 * INFORCE READ ONLY DATA
000212    05 INFORCE-FILE-LENGTH        COMP SYNC PIC S9(4) VALUE +12.
000213    05 INF-RECORD-KEY.
000214       10 INFORCE-KEY-FILE-CODE   PIC X.
000215       10 INFORCE-KEY-USER-ID     PIC X.
000216       10 INFORCE-KEY-POL-NUM     PIC X(10).

000217    05 INFORCE-BASIC-LENGTH       COMP SYNC PIC S9(4).
000218    05 INFORCE-RECSIZE            COMP PIC S9(8) VALUE +65000.
000219    05 FILLER REDEFINES INFORCE-RECSIZE.
000220       10 FILLER                  PIC X(2).
000221       10 INFORCE-PRMAX           COMP PIC 9(4).
000222    05 INFORCE-MAX-SEGS           COMP PIC S9(4) VALUE +4000.
000223    05 INFORCE-FILE-LENGTH        COMP SYNC PIC S9(4) VALUE +12.
000224    05 INF-RECORD-KEY.
000225       10 INFORCE-KEY-FILE-CODE   PIC X.
000226       10 INFORCE-KEY-USER-ID     PIC X.
000227       10 INFORCE-KEY-POL-NUM     PIC X(10).

000228    05 INFORCE-BASIC-LENGTH       COMP SYNC PIC S9(4).
000229    05 INFORCE-RECSIZE            COMP PIC S9(8) VALUE +65000.
000230    05 FILLER REDEFINES INFORCE-RECSIZE.
000231       10 FILLER                  PIC X(2).
000232       10 INFORCE-PRMAX           COMP PIC 9(4).
000233    05 INFORCE-MAX-SEGS           COMP PIC S9(4) VALUE +4000.

000234 * HISTORY READ ONLY DATA
000235    05 SDT-H-TABLE-NAME           PIC X(08) VALUE 'CKESDTBH'.
000236    05 HISTORY-REC-CTL-LEN        COMP PIC S9(4) VALUE +20.

000237    05 FNFORCE-VSAMX-INFO.
000238       10 FILLER                  PIC X(7) VALUE 'FVDUNLD'.
000239       10 FILLER                  PIC X VALUE LOW-VALUE.
000240       10 FILLER                  PIC X VALUE ' '.
000241       10 FILLER                  PIC X(08) VALUE LOW-VALUES.

000242    05 HISTORY-VSAMX-INFO.
000243       10 FILLER                  PIC X(7) VALUE 'FVDULHD'.
000244       10 FILLER                  PIC X VALUE LOW-VALUE.
000245       10 FILLER                  PIC X VALUE ' '.
000246       10 FILLER                  PIC X(11) VALUE LOW-VALUES.

000247 EJECT

000248 01 LOAD-PREM-GROSS-AMNT.
000249    05 WS-GROSS-AMNT-REC OCCURS 10 TIMES.
000250       10 WS-GROSS-AMNT           PIC S9(9)V99 COMP-3.

000251 01 CKUDT103-ENTRY.
000252    05 CKUDT103-ALPHA-STATE       PIC XX.
000253    05 CKUDT103-NUMERIC-STATE     PIC 9(02).

000254 EJECT

000255 01 TABLE-PARMS.
000256    COPY CKTBPARM.
000257 EJECT

000258 01 LOAD-PLAN-DESC-TABLE.
000259    05 WS-PLANDESC-REC OCCURS 600 TIMES.
000260       10 WS-PLAN-NAME            PIC X(11).
000261       10 WS-PLAN-DESC            PIC X(78).
000262       10 FILLER                  PIC X(14).

000263 ******************************************************************
000264 *                      VARIABLE DATA AREAS
000265 ******************************************************************
000266 ******************************************************************
000267 *                      VARIABLE DATA AREAS
000268 ******************************************************************

000269 01 VARIABLE-WORK-AREA.
000270    05 RECORD-LENGTH              PIC S9(8) COMP.
000271    05 HISTORY-FILE-LENGTH        COMP PIC S9(4).
000272    05 WS-HIGH-DURATION           COMP-3 PIC S9(5) VALUE +0.
000273    05 WS-LOW-DURATION            COMP-3 PIC S9(5) VALUE +0.
000274    05 WS-HISTORY-RCD-CNT         COMP-3 PIC S9(3) VALUE +0.
000275    05 WS-MULTIPLE-DURATION-IND   PIC X(01).
000276       88 CHECK-MULTIPLE-DURATION-RECS VALUE 'Y'.

000277    05 WS-69CTR                   PIC S9(9) COMP-3.
000278    05 WS-04-CTR                  PIC S9(4) COMP-3.
000279    05 WS-CTR                     PIC S9(9) COMP-3.
000280    05 WS-89CTR                   PIC S9(9) COMP-3.
000281    05 WS-OCTR                    PIC S9(9) COMP-3.
000282    05 WS-FLCSEQ-SEQUENCE         PIC X(01).
000283    05 WS-ACF-IO-BYTE             PIC X.
000284    05 WS-PCTR                    PIC S9(9) COMP-3.
000285    05 WS-PREM-GROSS-AMNT         PIC S9(09)V99 COMP-3.
000286    05 WS-RECEIPNT-ADDR           PIC X(100) VALUE SPACE.
000287    05 WS-FLC-SEQ                 PIC X(01).
000288    05 WS-ISSUE-AGE               PIC S9(03) COMP-3.
000289    05 WS-COMP-VAR55              PIC S9(03) COMP-3.
000290    05 WS-ISSUE-STATE             PIC X(02).
000291    05 WS-ERROR-MSG               PIC X(50).
000292    05 COMP-ISSUE-AGE             PIC S9(03) COMP-3.
000293    05 WS-SUB                     PIC S9(04) COMP-3 VALUE 0.
000294    05 WS-SUB-SAVE                PIC S9(04) COMP-3 VALUE 0.
000295    05 WS-SEG-ID                  PIC X(02).
000296    05 WS-STATUS                  PIC X(02).
000297    05 WS-FATCA-IND               PIC X(1).
000298    05 WS-FATCA-STATUS            PIC X(12).
000299    05 WS-FACE-AMT                PIC S9(9)V99 COMP-3.
000300    05 WS-INIT-PREM               PIC S9(9)V99 COMP-3.
000301    05 WS-GROSS-INIT-PREM         PIC S9(9)V99 COMP-3.
000302    05 WS-GROSS-TOT-AMNT          PIC S9(9)V99 COMP-3.
000303    05 WS-CUMM-AMT                PIC S9(09)V99 COMP-3.
000304    05 WS-GROSS-RECURING-PREM     PIC S9(9)V99 COMP-3.
000305    05 WS-AD-PLAN                 PIC X(05).
000306    05 WS-52SEG-ID                PIC X(02).
000307    05 WS-02SEG-ID                PIC X(02).
000308    05 WS-89SEG-ID                PIC X(02).
000309    05 WS-ADDR                    PIC X(90).
000310    05 WS-CITY                    PIC X(30).
000311    05 WS-STATE                   PIC X(2).
000312    05 WS-ZIP-CODE                PIC X(13).
000313    05 WS-90SEG-ID                PIC X(02).
000314    05 WS-PLAN-BASE               PIC X(03).
000315    05 WS-PLAN-TYPE               PIC X(01).
000316    05 WS-SEG-SEQ                 COMP-3 PIC S9(5).
000317    05 WS-52SEG-SEQ               COMP-3 PIC S9(5).
000318    05 WS-02SEG-SEQ               COMP-3 PIC S9(5).
000319    05 WS-89SEG-SEQ               COMP-3 PIC S9(5).
000320    05 WS-90SEG-SEQ               COMP-3 PIC S9(5).
000321    05 WS-SEG-WORK-AREA           PIC X(25000) VALUE SPACE.

000322 * DATA AREA
000323    05 WS-ASOF-TD-DATE            PIC X(04).
000324    05 WS-EXT-ASOF-DATE           PIC X(08).
000325    05 WS-EXT-ENTRY-DATE          PIC X(08).

000326    05 WS-CNTR                    PIC S9(3) COMP-3.
000327    05 WS-OWNR-EFF-CMPR-DATE      COMP-3.
000328       10 WS-OWNR-EFF-CMPR-MMYY   PIC S9(3).
000329       10 WS-OWNR-EFF-CMPR-DD     PIC S9(3).
000330 * DATA AREA
000331    05 WS-ASOF-TD-DATE            PIC X(04).
000332    05 WS-EXT-ASOF-DATE           PIC X(08).
000333    05 WS-EXT-ENTRY-DATE          PIC X(08).

000334    05 WS-CNTR                    PIC S9(3) COMP-3.
000335    05 WS-OWNR-EFF-CMPR-DATE      COMP-3.
000336       10 WS-OWNR-EFF-CMPR-MMYY   PIC S9(3).
000337       10 WS-OWNR-EFF-CMPR-DD     PIC S9(3).

000338    05 WS-OWNER-TBL OCCURS 6 TIMES.
000339       10 WS-OWNR-EFF-DATE        COMP-3.
000340          15 WS-OWNR-EFF-MMYY     PIC S9(3).
000341          15 WS-OWNR-EFF-DD       PIC S9(3).

000342    05 WS-MMYEAR-CODE-DATE        COMP-3.
000343       10 WS-MMYEAR-CODE-YEAR     PIC S9(05).
000344       10 WS-MMYEAR-CODE-DAY      PIC S9(03).

000345    05 WS-30DAY-CORR-MAT-DATE.
000346       10 WS-30D-CORR-MM          PIC X(02).
000347       10 WS-30D-CORR-DD          PIC X(02).
000348       10 WS-30D-CORR-YYYY        PIC X(04).

000349    05 WS-INT-BACK-DATE           COMP-3.
000350       10 WS-INT-BACK-MMYY        PIC S9(03).
000351       10 WS-INT-BACK-DD          PIC S9(03).

000352    05 WS-INT-NEXT-DATE           COMP-3.
000353       10 WS-INT-NEXT-MMYY        PIC S9(03).
000354       10 WS-INT-NEXT-DD          PIC S9(03).

000355    05 WS-INT-NEXT-DATE2          COMP-3.
000356       10 WS-INT-NEXT-MMYY2       PIC S9(03).
000357       10 WS-INT-NEXT-DD2         PIC S9(03).

000358    05 WS-60DAY-CORR-MAT-DATE.
000359       10 WS-60D-CORR-MM          PIC X(02).
000360       10 WS-60D-CORR-DD          PIC X(02).
000361       10 WS-60D-CORR-YYYY        PIC X(04).

000362    05 WS-90DAY-CORR-MAT-DATE.
000363       10 WS-90D-CORR-MM          PIC X(02).
000364       10 WS-90D-CORR-DD          PIC X(02).
000365       10 WS-90D-CORR-YYYY        PIC X(04).

000366    05 WS-EFFECTIVE-DATE.
000367       10 WS-EFFECTIVE-MM         PIC 9(02).
000368       10 WS-EFFECTIVE-DD         PIC 9(02).
000369       10 WS-EFFECTIVE-YYYY       PIC 9(04).

000370    05 WS-EXT-DATE.
000371       10 WS-EXT-MM               PIC 9(02).
000372       10 WS-EXT-DD               PIC 9(02).
000373       10 WS-EXT-YYYY             PIC 9(04).

000374    05 WS-BIRTH-DATE.
000375       10 WS-BRTH-MM              PIC 9(02).
000376       10 WS-BRTH-DD              PIC 9(02).
000377       10 WS-BRTH-YYYY            PIC 9(04).

000378    05 WS-POL-INFORCE-DATE.
000379       10 WS-POL-INFORCE-MM       PIC X(02) VALUE SPACE.
000380       10 WS-POL-INFORCE-DD       PIC X(02) VALUE SPACE.
000381       10 WS-POL-INFORCE-YYYY     PIC X(04) VALUE SPACE.

000382    05 WS-POL-RECEIPT-DATE.
000383       10 WS-POL-RECEIPT-MM       PIC X(02) VALUE SPACE.
000384       10 WS-POL-RECEIPT-DD       PIC X(02) VALUE SPACE.
000385       10 WS-POL-RECEIPT-YYYY     PIC X(04) VALUE SPACE.

000386    05 WS-EXT-CEASE-DATE          PIC X(08) VALUE SPACE.

000387    05 WS-CKDCARTH-CONTANTS.
000388       10 DCARTH-MONTHS           PIC S9(3) COMP-3.
000389       10 DCARTH-DAYS             PIC S9(3) COMP-3.
000390       10 DCARTH-YEARS            PIC S9(3) COMP-3.
000391       10 WS-DCARTH-ADD           PIC X VALUE '0'.
000392       10 WS-DCARTH-SUBTRACTION   PIC X VALUE '1'.
000393       10 WS-DCARTH-DIFFERENCE    PIC X VALUE '2'.

000394    05 WS-EXT-DOD-DATE            PIC X(08) VALUE SPACE.

000395    05 WS-EFF-DATE                COMP-3.
000396       10 WS-EFF-MMYY             PIC S9(3).
000397       10 WS-EFF-DD               PIC S9(3).

000398    05 WS-INIT-START-DATE.
000399       10 WS-INIT-START-MOYR      PIC S9(05) COMP-3.
000400       10 WS-INIT-START-DAY       PIC S9(03) COMP-3.

000401    05 WS-NEXT-WTHDRWL-DATE.
000402       10 WS-NEXT-SCHD-MM         PIC X(02) VALUE SPACE.
000403       10 WS-NEXT-SCHD-DD         PIC X(02) VALUE SPACE.
000404       10 WS-NEXT-SCHD-YYYY       PIC X(04) VALUE SPACE.

000405    05 WS-EXT-START-DATE.
000406       10 WS-EXT-START-MM         PIC 9(02).
000407       10 WS-EXT-START-DD         PIC 9(02).
000408       10 WS-EXT-START-YYYY       PIC 9(04).

000409    05 WS-INIT-NEXT-ACT-DATE.
000410       10 WS-NEXT-ACT-MOYR        PIC S9(05) COMP-3.
000411       10 WS-NEXT-ACT-DAY         PIC S9(03) COMP-3.

000412    05 WS-DEFERRED-DATE.
000413       10 WS-DEFER-MM             PIC 9(02).
000414       10 WS-DEFER-DD             PIC 9(02).
000415       10 WS-DEFER-YYYY           PIC 9(04).

000416    05 WS-NEW-MAT-DATE.
000417       10 WS-NEW-MAT-MM           PIC 9(02).
000418       10 WS-NEW-MAT-DD           PIC 9(02).
000419       10 WS-NEW-MAT-YYYY         PIC 9(04).

000420    05 WS-EXT-MAT-DATE.
000421       10 WS-EXT-MAT-MM           PIC 9(02).
000422       10 WS-EXT-MAT-DD           PIC 9(02).
000423       10 WS-EXT-MAT-YYYY         PIC 9(04).

000424    05 WS-DEFERRED-DATE.
000425       10 WS-DEFER-MM             PIC 9(02).
000426       10 WS-DEFER-DD             PIC 9(02).
000427       10 WS-DEFER-YYYY           PIC 9(04).

000428    05 WS-NEW-MAT-DATE.
000429       10 WS-NEW-MAT-MM           PIC 9(02).
000430       10 WS-NEW-MAT-DD           PIC 9(02).
000431       10 WS-NEW-MAT-YYYY         PIC 9(04).

000432    05 WS-EXT-MAT-DATE.
000433       10 WS-EXT-MAT-MM           PIC 9(02).
000434       10 WS-EXT-MAT-DD           PIC 9(02).
000435       10 WS-EXT-MAT-YYYY         PIC 9(04).

000436    05 WS-FORMAT3-DATE.
000437       10 WS-FORMAT3-MM           PIC 9(02).
000438       10 WS-FORMAT3-DD           PIC 9(02).
000439       10 WS-FORMAT3-YYYY         PIC 9(04).

000440    05 WS-TOTAL-NET-AMOUNT        PIC S9(09)V99.
000441    05 WS-PREM-TOTAL              PIC S9(11)V99 COMP-3.
000442    05 WS-NET-AMOUNT              PIC S9(09)V99.
000443    05 WS-BONUS-AMT               PIC S9(9)V99 COMP-3.
000444    05 WS-GROSS-AMT               PIC S9(9)V99 COMP-3.
000445    05 WS-ADDL-1035-AMT           PIC S9(9)V99 COMP-3.
000446    05 WS-ADDL-NRML-AMT           PIC S9(9)V99 COMP-3.
000447    05 WS-ADDL-ROLL-AMT           PIC S9(9)V99 COMP-3.
000448    05 WS-ADDL-TRST-AMT           PIC S9(9)V99 COMP-3.
000449    05 WS-NET-AMT-ED              PIC ZZZZZZZZ9.99.
000450    05 WS-SURR-CHARGES-ED         PIC ZZZZZZ9.99.
000451    05 WS-ASOF-SAVE-DATE          PIC X(04).
000452    05 WS-PRI-OWNER-ID            PIC X(03).

000453    05 WS-ASOF-DATE.
000454       10 WS-ASOF-MM              PIC 9(02).
000455       10 WS-ASOF-DD              PIC 9(02).
000456       10 WS-ASOF-YYYY            PIC 9(04).

000457    05 WS-WORK-DATE.
000458       10 WS-WORK-MM              PIC 9(02).
000459       10 WS-WORK-DD              PIC 9(02).
000460       10 WS-WORK-YYYY            PIC 9(04).

000461    05 WS-WORK-DATE2.
000462       10 WS-WORK2-MM             PIC 9(02).
000463       10 WS-WORK2-DD             PIC 9(02).
000464       10 WS-WORK2-YY             PIC 9(04).

000465 * DATE AREA

000466    05 WS-BEGDATE-EXT             PIC X(08).
000467    05 WS-BEGDATE-CF              COMP-3.
000468       10 WS-BEGDATE-DATE         PIC S9(5).
000469       10 WS-BEGDATE-DAY          PIC S9(3).

000470    05 WS-ENDDATE-EXT             PIC X(08).
000471    05 WS-ENDDATE-CF              COMP-3.
000472       10 WS-ENDDATE-DATE         PIC S9(5).
000473       10 WS-ENDDATE-DAY          PIC S9(3).

000474    05 WS-CURR-DATE.
000475       10 WS-CURR-YEAR            PIC 9(02).
000476       10 WS-CURR-MO              PIC 9(02).
000477       10 WS-CURR-DAY             PIC 9(02).

000478    05 WS-CURR-CONV-DATE.
000479       10 WS-CURR-CONV-MM         PIC 9(02).
000480       10 WS-CURR-CONV-DD         PIC 9(02).
000481       10 WS-CURR-CONV-CC         PIC 9(02).
000482       10 WS-CURR-CONV-YY         PIC 9(02).

000483    05 WS-INT-CEASE-DATE          COMP-3.
000484       10 WS-CURR-CEASE-YEAR      PIC S9(03).
000485       10 WS-CURR-CEASE-DAY       PIC S9(03).

000486    05 WS-INT-BEGIN-DATE          COMP-3.
000487       10 WS-INT-BEGIN-YEAR       PIC S9(3) VALUE +0.
000488       10 WS-INT-INTERNAL-DAY     PIC S9(3) VALUE +0.
000489    05 WS-INTER-BDATE             PIC X(04).

000490    05 WS-INT-END-DATE            COMP-3.
000491       10 WS-INT-END-YEAR         PIC S9(3) VALUE +0.
000492       10 WS-INT-END-DAY          PIC S9(3) VALUE +0.
000493    05 WS-INTER-EDATE             PIC X(04).
000494    05 WS-INT-WORK-DATE.
000495       10 WS-INT-WORK-MMYY        PIC S9(3) COMP-3.
000496       10 WS-INT-WORK-DD          PIC S9(3) COMP-3.

000497    05 WS-INT-MATURITY-DATE.
000498       10 WS-INT-MAT-MMYY         PIC S9(3) COMP-3.
000499       10 WS-INT-MAT-DD           PIC S9(3) COMP-3.

000500    05 WS-INT-DEFERRED-DATE.
000501       10 WS-INT-DEF-MMYY         PIC S9(3) COMP-3.
000502       10 WS-INT-DEF-DD           PIC S9(3) COMP-3.

000503    05 WS-ASOF-EXT-DATE.
000504       10 WS-ASOF-EXT-MM          PIC X(02) VALUE SPACE.
000505       10 WS-ASOF-EXT-DD          PIC X(02) VALUE SPACE.
000506       10 WS-ASOF-EXT-YEAR        PIC X(04) VALUE SPACE.

000507    05 WS-INT30-DATE.
000508       10 WS-INT30-MMYY           PIC S9(3) COMP-3.
000509       10 WS-INT30-DD             PIC S9(3) COMP-3.

000510    05 WS-INT60-DATE.
000511       10 WS-INT60-MMYY           PIC S9(3) COMP-3.
000512       10 WS-INT60-DD             PIC S9(3) COMP-3.

000513    05 WS-INT90-DATE.
000514       10 WS-INT90-MMYY           PIC S9(3) COMP-3.
000515       10 WS-INT90-DD             PIC S9(3) COMP-3.

000516    05 WS-INT-ISSUE-DATE          COMP-3.
000517       10 WS-INT-ISSUE-MMYY       PIC S9(03).
000518       10 WS-INT-ISSUE-DD         PIC S9(03).

000519    05 WS-ISSUE1-DATE             COMP-3.
000520       10 WS-ISSU1-MMYY           PIC S9(03).
000521       10 WS-ISSU1-DD             PIC S9(03).

000522    05 WS-ISSUE2-DATE             COMP-3.
000523       10 WS-ISSU2-MMYY           PIC S9(03).
000524       10 WS-ISSU2-DD             PIC S9(03).

000525    05 WS-TABLE-KEY.
000526       10 WS-TABLE-PLAN           PIC X(10).
000527       10 WS-TABLE-OPTION         PIC X(01).
000528       10 FILLER                  PIC X(18) VALUE LOW-VALUES.

000529    05 WS-TRANS-PLAN              PIC X(11).

000530    05 WS-TABLE-OUTPUT.
000531       10 FILLER                  PIC X(11).
000532       10 WS-TABLE-PLAN-DESC      PIC X(40).

000533    05 WS-FORMAT-DATE.
000534       10 WS-FORMAT-MM            PIC X(02) VALUE SPACE.
000535       10 WS-FORMAT-DD            PIC X(02) VALUE SPACE.
000536       10 WS-FORMAT-YYYY          PIC X(04) VALUE SPACE.

000537    05 WS-BEGIN-DATE-FORMAT       PIC X(10).
000538    05 WS-END-DATE-FORMAT         PIC X(10).

000539    05 WS-ISSUE-DATE.
000540       10 WS-ISSUE-MM             PIC X(02) VALUE SPACE.
000541       10 WS-ISSUE-DD             PIC X(02) VALUE SPACE.
000542       10 WS-ISSUE-YYYY           PIC X(04) VALUE SPACE.

000543    05 WS-APPL-DATE.
000544       10 WS-APPL-MM              PIC X(02) VALUE SPACE.
000545       10 WS-APPL-DAY             PIC X(02) VALUE SPACE.
000546       10 WS-APPL-YEAR            PIC X(04) VALUE SPACE.

000547    05 WS-DISB-DATE               COMP-3.
000548       10 WS-DISB-YEAR            PIC S9(3).
000549       10 WS-DISB-DAY             PIC S9(3).

000550    05 WS-DEPOS-DATE              COMP-3.
000551       10 WS-DEPOS-YEAR           PIC S9(3).
000552       10 WS-DEPOS-DAY            PIC S9(3).

000553    05 WS-CHECK-DATE              PIC X(08).

000554    05 WS-PD-SUB                  PIC S9(04) COMP-3 VALUE 0.
000555    05 WS-SUB                     PIC S9(3) COMP-3.
000556    05 WS-SUB2                    PIC S9(3) COMP-3.
000557    05 RP-INDEX                   USAGE IS INDEX.

000558    05 WS-POLICY-READ-CNT         PIC 9(09) VALUE ZERO.
000559    05 WS-POLICY-READ-2           PIC 9(09) VALUE ZERO.
000560    05 TERMINATED-COUNT           PIC 9(09) VALUE ZERO.
000561    05 PASSED-TERMINATED-COUNT    PIC 9(09) VALUE ZERO.
000562    05 ACTIVE-COUNT               PIC 9(09) VALUE ZERO.
000563    05 WS-RP-LINE-COUNT           PIC 9(03) VALUE ZERO.

000564    05 WS-PD-IND                  PIC X(1).
000565       88 WS-PD-FOUND             VALUE 'Y'.
000566       88 WS-PD-NOT-FOUND         VALUE 'N'.

000567 * COUNTERS
000568    05 WS-WORK-COUNTERS.
000569       10 WS-READ-I-CNTR          PIC S9(9) COMP-3.
000570       10 WS-READ-H-CNTR          PIC S9(9) COMP-3.
000571       10 WS-FULLSURR-CNTR        PIC S9(9) COMP-3.
000572       10 WS-TERM-DEAD-CNTR       PIC S9(9) COMP-3.
000573       10 WS-PRTWITH-CNTR         PIC S9(9) COMP-3.
000574       10 WS-INIT-PAY-CNTR        PIC S9(9) COMP-3.
000575       10 WS-ADDTL-PAY-CNTR       PIC S9(9) COMP-3.
000576       10 WS-REG-PAY-CNTR         PIC S9(9) COMP-3.
000577       10 WS-REIN-PAY-CNTR        PIC S9(9) COMP-3.
000578       10 WS-LOAN-PAY-CNTR        PIC S9(9) COMP-3.
000579       10 WS-POL-FOUND-CNTR       PIC S9(9) COMP-3.
000580       10 WS-REC-WRITTEN-CNTR     PIC S9(9) COMP-3.
000581       10 WS-COUNTER-WITH         PIC S9(9) COMP-3.
000582       10 WS-COUNTER-SURR-CHG     PIC S9(9) COMP-3.

000583 EJECT
000584 ******************************************************************
000585 * INPUT DATE CARD AREA - DATE FORMAT MMDDYYYYMMDDYYYY
000586 ******************************************************************

000587 01 WS-CARDIN-AREA.
000588    05 BEGIN-DATE                 PIC X(08).
000589 01 WS-CARDIN-AREA.
000590    05 BEGIN-DATE                 PIC X(08).
000591    05 END-DATE                   PIC X(08).
000592    05 FILLER                     PIC X(64).
000593 EJECT

000594 ******************************************************************
000595 * INFORCE RECORD CONTROL SECTION
000596 ******************************************************************

000597 01 INFORCE-FILE-AREA.
000598    05 INFORCE-REC-LENGTH         PIC S9(4) COMP.
000599    05 INFORCE-FILE-KEY.
000600       10 INFORCE-REC-ID          PIC X(01).
000601       10 INFORCE-USER-ID         PIC X(1).
000602       10 INFORCE-POL-NUMBER      PIC X(10).
000603    05 INFORCE-IO-STAT            PIC X(01).
000604    05 FILLER                     PIC X(64985).
000605 EJECT

000606 01 INFORCE-FILE-DCB.
000607    COPY CKDCBMAX.
000608 EJECT

000609 01 INFORCE-FILE-AUXDCB           PIC X(25000).
000610 01 HISTORY-FILE-AUXDCB           PIC X(25000).
000611 EJECT

000612 ******************************************************************
000613 * HISTORY RECORD CONTROL SECTION
000614 ******************************************************************

000615    COPY CKNRECRC.
000616    05 FILLER                     PIC X(13980).
000617 EJECT

000618 01 HISTORY-FILE-DCB.
000619    COPY CKDCBLRG.
000620    COPY CKUBGPRM.
000621 EJECT

000622 ******************************************************************
000623 * OUTPUT RECORD
000624 ******************************************************************

000625 01 OFFLINE-RECORD                PIC X(1000) VALUE SPACE.
000626 EJECT

000627 ******************************************************************
000628 * REPORT RECORD
000629 ******************************************************************

000630 01 RP-RECORD.
000631    05 RP-POLICY                  PIC X(08).
000632    05 FILLER                     PIC X(01) VALUE X'05'.
000633    05 RP-POL-STATUS              PIC X(02).
000634    05 FILLER                     PIC X(01) VALUE X'05'.
000635    05 RP-STATUS                  PIC X(25).
000636    05 FILLER                     PIC X(01) VALUE X'05'.
000637    05 RP-ISSUE-DATE              PIC X(10).
000638    05 FILLER                     PIC X(01) VALUE X'05'.
000639    05 RP-PRODUCT-NAME            PIC X(51).
000640    05 FILLER                     PIC X(01) VALUE X'05'.
000641    05 RP-OWNER-NAME              PIC X(30).
000642    05 FILLER                     PIC X(01) VALUE X'05'.
000643    05 RP-OWNER-ADDR              PIC X(50).
000644    05 FILLER                     PIC X(01) VALUE X'05'.
000645    05 RP-PLAN-CODE               PIC X(10).
000646    05 FILLER                     PIC X(01) VALUE X'05'.
000647    05 RP-ISSUE-STATE             PIC X(05).
000648    05 FILLER                     PIC X(01) VALUE X'05'.
000649    05 RP-ISSUE-AGE               PIC X(05).
000650    05 FILLER                     PIC X(01) VALUE X'05'.
000651    05 TAB1 OCCURS 5 TIMES.
000652       10 RP-OWNER-NAME           PIC X(81).
000653       10 FILLER                  PIC X(01) VALUE X'05'.
000654 EJECT

000655 ******************************************************************
000656 * SEGMENT AREA PLUS
000657 ******************************************************************

000658    COPY CKFRECCV.
000659 EJECT
000660    COPY CKFRECSB.
000661 EJECT
000662    COPY CKFRECAU.
000663 EJECT
000664    COPY CKFRECIF.
000665 EJECT
000666    COPY CKAPIFLG.
000667 EJECT
000668    COPY CKFRECUM.
000669 EJECT

000670 N16623 01 ALLOCATION-SECTION-SEGMENT.
000671 N16623    COPY CKFRECAL.
000672 EJECT

000673 N16623 01 ALLOCATION-FLAG-BYTES.
000674 N16623    COPY CKFLGFAL.
000675 EJECT

000676    COPY CKFRECRC.
000677    03 FILLER                     PIC X(64980).
000678 EJECT

000679    COPY CKULGPRM.
000680 EJECT

000681    COPY CKULAFG REPLACING ACTIVITY-FLAGS BY
000682                        ACTIVITY-SEG-FLAG-BYTES.
000683 EJECT

000684 01 USER-SEGMENT.
000685    COPY CKFRECUZ.
000686 EJECT

000687 01 REPLACEMENT-SEGMENT.
000688    COPY CKFRECTR.
000689 EJECT

000690 01 INQUIRY-LIFE-CNTL-SEGMENT.
000691    COPY CKFRECLC.
000692 EJECT

000693 01 NEW-BUSINESS-SEGMENT.
000694    COPY CKFRECNB.
000695 EJECT
000696    COPY CKFRECUR.
000697 EJECT
000698    COPY CKFRECNA.
000699 EJECT
000700    COPY CKFRECBC.
000701 EJECT
000701     EJECT
000702     COPY CKAPIFLG.
000703     EJECT
000704     COPY CKFRECUM.
000705 N16623 01  ALLOCATION-SECTION-SEGMENT.
000706 N16623     COPY CKFRECAL.
000707     EJECT
000708 N16623 01  ALLOCATION-FLAG-BYTES.
000709 N16623     COPY CKFLGFAL.
000710     EJECT
000711     COPY CKFRECRC.
000712     03  FILLER                    PIC X(64980).
000713     EJECT
000714     COPY CKULGPRM.
000715     EJECT
000716     COPY CKULAFLG REPLACING ACTIVITY-FLAGS BY
000717                                ACTIVITY-SEG-FLAG-BYTES.
000718     EJECT
000719 01  USER-SEGMENT.
000720     COPY CKFRECUZ.
000721     EJECT
000722 01  REPLACEMENT-SEGMENT.
000723     COPY CKFRECTR.
000724     EJECT
000725 01  INQUIRY-LIFE-CNTL-SEGMENT.
000726     COPY CKFRECLC.
000727     EJECT
000728 01  NEW-BUSINESS-SEGMENT.
000729     COPY CKFRECNB.
000730     EJECT
000731     COPY CKFRECUR.
000732     EJECT
000733     COPY CKFRECNA.
000734 EJECT
000735 COPY CKFRECBC.
000736 EJECT

000737 01 AP-CONTROL-FLAG-BYTES.
000738    COPY CKFULFLG.
000739 EJECT
000740 COPY CKFRECUL.
000741 EJECT
000742 COPY CKFRECUY.
000743 EJECT
000744 COPY CKFRECUA.
000745 EJECT
000746 COPY CKFRECBR.
000747 EJECT
000748 COPY CKFRECNO.
000749 EJECT
000750 COPY CKFRECUV.
000751 EJECT

000752 01 WS-ACF-AREA.
000753    05 WS-ACF-BASIC-SECTION.
000754       10 WS-ACF-LNGTH            PIC S9(04) COMP.
000755       10 WS-ACF-RECID            PIC X(01).
000756       10 WS-ACF-CNTRL.
000757          15 WS-USER              PIC X(01).
000758       10 WS-ACF-REST-OF-BASIC    PIC X(75).
000759    05 WS-ACF-REST                PIC X(13911).

000760 01 WS-ACF-DCB                    PIC X(25000).
000761 EJECT

000762 * AUXSEG1 RECORD AREA
000763 COPY CKAUXDCB REPLACING AUXBLOCK-AUXILIARY-DCB
000764                         BY AUX-INF-DCB.
000765 EJECT
000766 COPY CKESDTB1 REPLACING SEGMENT-DEFINITION-TABLE BY
000767                         INFORCE-AUX-SDT.
000768 EJECT

000769 * AUXSEGH RECORD AREA
000770 COPY CKAUXDCB REPLACING AUXBLOCK-AUXILIARY-DCB
000771                         BY AUX-HIST-DCB.
000772 EJECT
000773 COPY CKESDTB1 REPLACING SEGMENT-DEFINITION-TABLE BY
000774                         HISTORY-AUX-SDT.
000775 EJECT

000776 ******************************************************************
000777 * BATCH I/O RECORD
000778 ******************************************************************

000779 COPY CKBCHCDS REPLACING
000780       BCHCODES-CALLING-CODES BY BCHCODES.

000781 01 FILLER                        PIC X(32)
000782       VALUE 'NYF22766 WORKING STORAGE ENDS  '.
000783 EJECT

000784 LINKAGE SECTION.
000785 EJECT

000786 PROCEDURE DIVISION.
000787 ******************************************************************
000788 *                 MAINLINE LOGIC
000789 ******************************************************************

000790 0000-CONTROL-PROCESS.
000791     PERFORM 1000-INITIALIZATION
000792         THRU 1099-INITIALIZATION-EXIT.

000793     PERFORM 1100-OPEN-FILES
000794         THRU 1199-OPEN-FILES-EXIT.

000795     SET CONTINUE-PROCESSING TO TRUE.
000796     MOVE SPACE TO END-OF-FILE-INDICATOR.
000797     MOVE 'N' TO END-OF-TABLE-INDICATOR.

000798     PERFORM 2000-MAIN-PROCESS
000799         THRU 2000-MAIN-PROCESS-EXIT
000800         UNTIL END-OF-FILE.

000801     PERFORM EOJ9000-CLOSE-FILES
000802         THRU EOJ9999-EXIT.

000803     GOBACK.
000804 EJECT
000811     GOBACK.
000812     EJECT
000813 ******************************************************************
000814 *                        INITIALIZATION
000815 ******************************************************************
000816 1000-INITIALIZATION.

000817     CALL 'CKSETADR' USING BINARY1
000818                         UBAUXHCB-AUX-HIST-DCB-ADDR
000819                         AUX-HIST-DCB.

000820     MOVE LOW-VALUES TO AUX-HIST-DCB.

000821     CALL 'CKSETADR' USING BINARY1
000822                         AUXSEGDT-PTR OF AUX-HIST-DCB
000823                         HISTORY-AUX-SDT.

000824     MOVE ZERO TO WS-IO-CODE.
000825     MOVE ZERO TO WS-PD-SUB.
000826     MOVE LOW-VALUES TO INFORCE-FILE-DCB.
000827     INITIALIZE INFORCE-FILE-AREA.

000828     CALL 'CKCOBCRD' USING WS-CARDIN-AREA
000829                         WS-IO-CODE.

000830     MOVE 'N' TO END-OF-TABLE-INDICATOR.

000831     INITIALIZE WS-WORK-COUNTERS.

000832 * GET CURRENT DATE
000833     ACCEPT WS-CURR-DATE FROM DATE.
000834     MOVE WS-CURR-MO   TO WS-CURR-CONV-MM.
000835     MOVE WS-CURR-DAY  TO WS-CURR-CONV-DD.
000836     MOVE 20           TO WS-CURR-CONV-CC.
000837     MOVE WS-CURR-YEAR TO WS-CURR-CONV-YY.
000838 CBR1 *
000839 CBR1 * CALL 'CKDCEXIN' USING WS-CURR-CONV-DATE
000840 CBR1 *                      WS-INT-CURR-DATE.

000841 1099-INITIALIZATION-EXIT.
000842     EXIT.
000843     EJECT

000844 ******************************************************************
000845 *                        OPEN ALL FILES
000846 ******************************************************************
000847 1100-OPEN-FILES.

000848 * OPEN OUTPUT SEQUENTIAL FILES
000849     MOVE BCHTAPE1-TAPE1 TO BCHCODES-CALLING-FILE.
000850     MOVE BCHOPENO-OPEN-OUTPUT TO BCHCODES-CALLING-RETURN.

000851     PERFORM SUB4000-IOROUTINE
000852         THRU SUB4999-IO-ROUTINE-EXIT.

000853 * OPEN AGENT CONTROL FILE

000854     IF WS-IO-CODE NOT EQUAL '0'
000855         DISPLAY 'OPEN INFORCE FAILED'
000856         DISPLAY 'WS-IO-CODE=' WS-IO-CODE
000857         GO TO EOJ9900-ABEND.

000858     MOVE '6' TO WS-IO-CODE.
000859     CALL 'CKSDT1IO' USING WS-IO-CODE
000860                           INFORCE-AUX-SDT.

000861     IF WS-IO-CODE NOT EQUAL '0'
000862         DISPLAY 'OPEN OF AUXSEG1 FILE FAILED'
000863         DISPLAY 'WS-IO-CODE=' WS-IO-CODE
000864         GO TO EOJ9900-ABEND.

000865     MOVE '6' TO WS-IO-CODE.
000866     CALL 'CKSDTXIO' USING WS-IO-CODE
000867                           HISTORY-AUX-SDT
000868                           SDT-H-TABLE-NAME.

000869     IF WS-IO-CODE NOT EQUAL '0'
000870         DISPLAY 'OPEN OF AUXSEGH FILE FAILED'
000871         DISPLAY 'WS-IO-CODE=' WS-IO-CODE
000872         GO TO EOJ9900-ABEND.

000873     MOVE '4' TO WS-IO-CODE.
000874     CALL 'CKETRLST' USING WS-IO-CODE
000875                           WS-DUMMY
000876                           INFORCE-FILE-DCB
000877                           WS-DUMMY
000878                           WS-DUMMY
000879                           WS-DUMMY
000880                           AUX-INF-DCB.

000881     MOVE '4' TO WS-IO-CODE.
000882     CALL 'CKETRLST' USING WS-IO-CODE
000883                           WS-DUMMY
000884                           HISTORY-FILE-DCB
000885                           WS-DUMMY
000886                           WS-DUMMY
000887                           WS-DUMMY
000888                           AUX-HIST-DCB
000889                           HISTORY-AUX-SDT.

000890 * OPEN HISTORY AND AUXSEGH FILES
000891     MOVE HISTORY-VSAMX-INFO TO UBHIST-HISTORY-VSAMX.
000892     MOVE '6' TO WS-IO-CODE.
000893     CALL 'CKVSAMIO' USING HISTORY-VSAM
000894                           WS-IO-CODE
000895                           HISTORY-RECORD
000896                           HISTORY-FILE-LENGTH
000897                           NRCSRCHK-SEARCH-KEY
000898                           UBHIST-HISTORY-VSAMX.

000899     IF WS-IO-CODE NOT EQUAL '0'
000900         DISPLAY 'OPEN HISTORY FAILED'
000901         DISPLAY 'WS-IO-CODE=' WS-IO-CODE
000902         GO TO EOJ9900-ABEND.

000903     MOVE '6' TO WS-IO-CODE.
000904     CALL 'CKSDTXIO' USING WS-IO-CODE
000905                           HISTORY-AUX-SDT
000906                           SDT-H-TABLE-NAME.
000925     MOVE '6' TO WS-IO-CODE.
000926     CALL 'CKSDTXIO' USING WS-IO-CODE
000927                           HISTORY-AUX-SDT
000928                           SDT-H-TABLE-NAME.

000929     IF WS-IO-CODE NOT EQUAL '0'
000930         DISPLAY 'OPEN OF AUXSEGH FILE FAILED'
000931         DISPLAY 'WS-IO-CODE=' WS-IO-CODE
000932         GO TO EOJ9900-ABEND.

000933     MOVE '4' TO WS-IO-CODE.
000934     CALL 'CKETRLST' USING WS-IO-CODE
000935                           WS-DUMMY
000936                           HISTORY-FILE-DCB
000937                           WS-DUMMY
000938                           WS-DUMMY
000939                           WS-DUMMY
000940                           AUX-HIST-DCB
000941                           HISTORY-AUX-SDT.

000942 1199-OPEN-FILES-EXIT.
000943     EXIT.
000944     EJECT

000945 ******************************************************************
000946 *                        MAIN PROCESS
000947 ******************************************************************
000948 2000-MAIN-PROCESS.

000949     PERFORM 2100-READ-INFORCE
000950         THRU 2199-READ-INFORCE-EXIT.

000951     IF END-OF-FILE
000952         GO TO 2000-MAIN-PROCESS-EXIT
000953     END-IF.

000954 * PROCESS VA POLICIES ONLY
000955     IF ((FRCCNTRT-CONTRACT-NUMBER(1:1) = '5' OR '6'))
000956         GO TO 2000-MAIN-PROCESS
000957     ELSE
000958         GO TO CONTINUE-RTN
000959     END-IF.

000960 CONTINUE-RTN.

000961     INITIALIZE RP-RECORD.

000962     MOVE FRCCNTRT-CONTRACT-NUMBER TO RP-POLICY.

000963     SET INFORCE-FILE TO TRUE.

000964     PERFORM P100-PROCESS-SEG-01
000965         THRU P100-PROCESS-SEG-01-EXIT.

000966     PERFORM P200-PROCESS-SEG-02
000967         THRU P200-PROCESS-SEG-02-EXIT.

000968     PERFORM P200-PROCESS-SEG-52
000969         THRU P200-PROCESS-SEG-52-EXIT.

000970     PERFORM P400-PROCESS-SEG-89
000971         THRU P400-PROCESS-SEG-89-EXIT.

000972 *** WRITE REPORT
000973 CBR1     MOVE SPACE TO OFFLINE-RECORD.
000974 CBR1     MOVE RP-RECORD TO OFFLINE-RECORD.
000975 CBR1     MOVE BCHWRITN-WRITE-NEW
000976 CBR1         TO BCHCODES-CALLING-RETURN.
000977 CBR1     MOVE BCHTAPE1-TAPE1
000978 CBR1         TO BCHCODES-CALLING-FILE.
000979 CBR1     PERFORM SUB4000-IOROUTINE
000980 CBR1         THRU SUB4999-IO-ROUTINE-EXIT.

000981 SKIP-PROCESSING.

000982     MOVE '4' TO WS-IO-CODE.
000983     CALL 'CKETRLST' USING WS-IO-CODE
000984                           WS-DUMMY
000985                           INFORCE-FILE-DCB
000986                           WS-DUMMY
000987                           WS-DUMMY
000988                           WS-DUMMY
000989                           AUX-INF-DCB.

000990     MOVE '4' TO WS-IO-CODE.
000991     CALL 'CKETRLST' USING WS-IO-CODE
000992                           WS-DUMMY
000993                           HISTORY-FILE-DCB
000994                           WS-DUMMY
000995                           WS-DUMMY
000996                           WS-DUMMY
000997                           AUX-HIST-DCB
000998                           HISTORY-AUX-SDT.

000999 2000-MAIN-PROCESS-EXIT.
001000     EXIT.
001001     EJECT

001002 ******************************************************************
001003 * THIS ROUTINE WILL READ THE INFORCE FILE AND DO A TRAILER LIST
001004 * LIST ON THE RECORD.
001005 ******************************************************************
001006 2100-READ-INFORCE.

001007     MOVE '4' TO WS-IO-CODE.
001008     CALL 'CKETRLST' USING WS-IO-CODE
001009                           WS-DUMMY
001010                           INFORCE-FILE-DCB
001011                           WS-DUMMY
001012                           WS-DUMMY
001013                           WS-DUMMY
001014                           AUX-INF-DCB.

001015     MOVE '4' TO WS-IO-CODE.
001016     CALL 'CKETRLST' USING WS-IO-CODE
001035                           WS-DUMMY
001036                           AUX-INF-DCB.

001037     MOVE '4' TO WS-IO-CODE.
001038     CALL 'CKETRLST' USING WS-IO-CODE
001039                           WS-DUMMY
001040                           HISTORY-FILE-DCB
001041                           WS-DUMMY
001042                           WS-DUMMY
001043                           WS-DUMMY
001044                           AUX-HIST-DCB
001045                           HISTORY-AUX-SDT.

001046     MOVE '2' TO WS-IO-CODE.
001047     CALL 'CKVSAMIO' USING INFORCE-VSAM
001048                           WS-IO-CODE
001049                           INQUIRY-RECORD-CONTROL-SECTION
001050                           INFORCE-FILE-LENGTH
001051                           INF-RECORD-KEY
001052                           INFORCE-VSAMX-INFO.

001053     IF WS-IO-CODE = '6' OR
001054        FRCCNTRT-CONTRACT-NUMBER EQUAL HIGH-VALUES
001055         SET END-OF-FILE TO TRUE
001056         SET END-OF-PROCESSING TO TRUE
001057         GO TO 2199-READ-INFORCE-EXIT.

001058     IF FRCCNTRT-CONTRACT-NUMBER EQUAL 'A'
001059         GO TO 2100-READ-INFORCE.

001060     IF WS-IO-CODE NOT EQUAL '0'
001061         DISPLAY 'INFORCE READ ERROR'
001062         DISPLAY 'WS-IO-CODE=' WS-IO-CODE
001063         GO TO EOJ9900-ABEND.

001064     MOVE '4' TO WS-IO-CODE.
001065     CALL 'CKETRLST' USING WS-IO-CODE
001066                           WS-DUMMY
001067                           INFORCE-FILE-DCB
001068                           WS-DUMMY
001069                           WS-DUMMY
001070                           WS-DUMMY
001071                           AUX-INF-DCB.

001072     MOVE '4' TO WS-IO-CODE.
001073     CALL 'CKETRLST' USING WS-IO-CODE
001074                           WS-DUMMY
001075                           HISTORY-FILE-DCB
001076                           WS-DUMMY
001077                           WS-DUMMY
001078                           WS-DUMMY
001079                           AUX-HIST-DCB
001080                           HISTORY-AUX-SDT.

001081     MOVE '0' TO WS-IO-CODE.
001082     MOVE 'C' TO AUXEFLG1 OF AUX-INF-DCB.
001083     MOVE 'S' TO AUXEFLG2 OF AUX-INF-DCB.
001084     MOVE 'I' TO AUXEFLG3 OF AUX-INF-DCB.
001085     MOVE 'F' TO AUXEFLG4 OF AUX-INF-DCB.
001086     MOVE 'V' TO AUXEFLG6 OF AUX-INF-DCB.
001087     MOVE AUX-INF-DCB TO INFORCE-FILE-AUXDCB.

001088     MOVE LENGTH OF INQUIRY-RECORD-CONTROL-SECTION
001089         TO INFORCE-BASIC-LENGTH.

001090     CALL 'CKETRLST' USING WS-IO-CODE
001091                           INQUIRY-RECORD-CONTROL-SECTION
001092                           INFORCE-FILE-DCB
001093                           INFORCE-BASIC-LENGTH
001094                           INFORCE-PRMAX
001095                           INFORCE-MAX-SEGS
001096                           INFORCE-FILE-AUXDCB
001097                           INFORCE-AUX-SDT.

001098     IF WS-IO-CODE NOT EQUAL '0'
001099         DISPLAY 'ERROR IN SDT BUILD AUX1, RC = ' WS-IO-CODE
001100         ' POLICY NUMBER = ' FRCCNTRT-CONTRACT-NUMBER
001101         GO TO EOJ9900-ABEND
001102     END-IF.

001103     MOVE '0' TO WS-IO-CODE.
001104     MOVE 'C' TO AUXEFLG1 OF AUX-HIST-DCB.
001105     MOVE 'S' TO AUXEFLG2 OF AUX-HIST-DCB.
001106     MOVE 'I' TO AUXEFLG3 OF AUX-HIST-DCB.
001107     MOVE 'F' TO AUXEFLG4 OF AUX-HIST-DCB.
001108     MOVE 'V' TO AUXEFLG6 OF AUX-HIST-DCB.

001109     MOVE AUX-HIST-DCB TO HISTORY-FILE-AUXDCB.

001110     CALL 'CKETRLST' USING WS-IO-CODE
001111                           HISTORY-RECORD
001112                           HISTORY-FILE-DCB
001113                           INFORCE-BASIC-LENGTH
001114                           INFORCE-PRMAX
001115                           INFORCE-MAX-SEGS
001116                           HISTORY-FILE-AUXDCB
001117                           HISTORY-AUX-SDT.

001118     IF WS-IO-CODE NOT EQUAL '0'
001119         DISPLAY 'ERROR IN SDT BUILD AUXH, RC = ' WS-IO-CODE
001120         ' POLICY NUMBER = ' FRCCNTRT-CONTRACT-NUMBER
001121         GO TO EOJ9900-ABEND
001122     END-IF.

001123 2199-READ-INFORCE-EXIT.
001124     EXIT.
001125     EJECT

001126 ******************************************************************
001127 *                       END OF JOB
001128 ******************************************************************

001129 EOJ9900-ABEND.
001130     CALL 'CKABEND'.
001131     EJECT
001142 ******************************************************************
001143 *                          END OF JOB
001144 ******************************************************************

001145 EOJ9900-ABEND.
001146     CALL 'CKABEND'.
001147     EJECT

001148 ******************************************************************
001149 *                          CLOSE FILES
001150 ******************************************************************

001151 EOJ9000-CLOSE-FILES.

001152 * CLOSE OUTPUT SEQUENTIAL FILE
001153     MOVE BCHTAPE1-TAPE1 TO BCHCODES-CALLING-FILE.
001154     MOVE BCHCLOSE-CLOSE TO BCHCODES-CALLING-RETURN.
001155     PERFORM SUB4000-IOROUTINE
001156         THRU SUB4999-IO-ROUTINE-EXIT.

001157 DEBUG GO TO EOJ9999-EXIT.

001158 * CLOSE INFORCE FILE
001159     MOVE '5' TO WS-IO-CODE.
001160     CALL 'CKVSAMIO' USING INFORCE-VSAM
001161                           WS-IO-CODE.

001162     IF WS-IO-CODE NOT EQUAL '0'
001163         DISPLAY 'CLOSE INFORCE FAILED'
001164         DISPLAY 'WS-IO-CODE=' WS-IO-CODE
001165     END-IF.

001166 * CLOSE HISTORY FILE
001167     MOVE '5' TO WS-IO-CODE.
001168     CALL 'CKVSAMIO' USING HISTORY-VSAM
001169                           WS-IO-CODE
001170                           WS-DUMMY
001171                           WS-DUMMY
001172                           WS-DUMMY
001173                           UBHIST-HISTORY-VSAMX.

001174     IF WS-IO-CODE NOT EQUAL '0'
001175         DISPLAY 'CLOSE HISTORY FAILED'
001176         DISPLAY 'WS-IO-CODE=' WS-IO-CODE
001177     END-IF.

001178     MOVE '5' TO WS-IO-CODE.
001179     CALL 'CKSDT1IO' USING WS-IO-CODE
001180                           INFORCE-AUX-SDT.

001181     MOVE '5' TO WS-IO-CODE.
001182     CALL 'CKSDTXIO' USING WS-IO-CODE
001183                           HISTORY-AUX-SDT
001184                           SDT-H-TABLE-NAME.

001185     DISPLAY ' !! PROGRAM COMPLETED SUCCESSFULLY !!'.
001186     DISPLAY ' '.

001187 EOJ9999-EXIT.
001188     EXIT.
001189     EJECT

001190 ******************************************************************
001191 *                    PROCESS POLICY BASIC SEGMENT
001192 ******************************************************************

001193 P100-PROCESS-SEG-01.
001194     MOVE +0    TO WS-SEG-SEQ.
001195     MOVE '01'  TO WS-SEG-ID.

001196     PERFORM SUB7000-GET-TRLR
001197         THRU SUB7999-GET-TRLR-EXIT.

001198     IF WS-IO-CODE IS NOT EQUAL TO '0'
001199         GO TO P100-PROCESS-SEG-01-EXIT
001200     END-IF.

001201     MOVE WS-SEG-WORK-AREA TO INQUIRY-BASIC-SECTION.
001202     MOVE FBRISTAT-ISSUE-STATE TO RP-ISSUE-STATE.

001203     IF FBRSTAT-STATUS NOT EQUAL '22'
001204         GO TO 2000-MAIN-PROCESS
001205     END-IF.

001206     MOVE FBRSTAT-STATUS TO RP-POL-STATUS.

001207     IF FBRSTAT1-BYTE1 NOT EQUAL '9'
001208         EVALUATE TRUE
001209             WHEN FBRSTAT-STATUS EQUAL '12'
001210                 MOVE 'NEW BUSINESS NOT PAID' TO RP-STATUS
001211             WHEN FBRSTAT-STATUS EQUAL '21'
001212                 MOVE 'ACTIVE--PREMIUM PAY' TO RP-STATUS
001213             WHEN FBRSTAT-STATUS EQUAL '22'
001214                 MOVE 'ACTIVE--PREMIUM PAY' TO RP-STATUS
001215             WHEN FBRSTAT-STATUS EQUAL '32'
001216                 MOVE 'DISABILITY OR COI' TO RP-STATUS
001217             WHEN FBRSTAT-STATUS EQUAL '33'
001218                 MOVE 'DISABILITY WAIVER' TO RP-STATUS
001219             WHEN FBRSTAT-STATUS EQUAL '38'
001220                 MOVE 'DEATH CLAIM PEND' TO RP-STATUS
001221             WHEN FBRSTAT-STATUS EQUAL '95'
001222                 MOVE 'RESCINDED' TO RP-STATUS
001223             WHEN FBRSTAT-STATUS EQUAL '97'
001224                 MOVE 'REINSTATEMENT PENDING' TO RP-STATUS
001225             WHEN FBRSTAT-STATUS EQUAL '98' OR '99'
001226                 MOVE 'TERMINATED' TO RP-STATUS
001227             WHEN OTHER
001228                 MOVE ' ' TO RP-STATUS
001229         END-EVALUATE
001230     END-IF.

001231     IF FBRSTAT1-BYTE1 EQUAL '9'
001232         EVALUATE TRUE
001233             WHEN FBRLSTEN-LAST EQUAL 'L'
001234                 MOVE 'DECEASED' TO RP-STATUS
001235             WHEN FBRLSTEN-LAST EQUAL 'Q'
001236                 MOVE 'LAPSED' TO RP-STATUS
001237             WHEN FBRLSTEN-LAST EQUAL 'M'
001238                 MOVE 'MATURED' TO RP-STATUS
001239             WHEN FBRLSTEN-LAST EQUAL 'X'
001254             WHEN FBRLSTEN-LAST EQUAL 'M'
001255                 MOVE 'MATURED' TO RP-STATUS
001256             WHEN FBRLSTEN-LAST EQUAL 'X'
001257                 MOVE 'FREE LOOK' TO RP-STATUS
001258             WHEN OTHER
001259                 MOVE 'SURRENDERED' TO RP-STATUS
001260         END-EVALUATE
001261     END-IF.

001262 P100-PROCESS-SEG-01-EXIT.
001263     EXIT.
001264     EJECT

001265 ******************************************************************
001266 *              PROCESS POLICY COVERAGE (02) SEGMENT
001267 ******************************************************************

001268 P200-PROCESS-SEG-02.
001269     MOVE +0  TO WS-SEG-SEQ.
001270     MOVE '02' TO WS-SEG-ID.

001271 P200-NEXT-SEG-02.

001272     PERFORM SUB7000-GET-TRLR
001273         THRU SUB7999-GET-TRLR-EXIT.

001274     IF WS-IO-CODE NOT EQUAL '0'
001275         GO TO P200-PROCESS-SEG-02-EXIT
001276     END-IF.

001277     MOVE WS-SEG-WORK-AREA TO INQUIRY-COVERAGE-SEGMENT.
001278     MOVE FCVBASE-BASE TO RP-PLAN-CODE.

001279     IF NOT FCVPHASE-BASIC-COV-PHASE
001280         GO TO P200-NEXT-SEG-02
001281     END-IF.

001282     EVALUATE FCVBASE-BASE
001283         WHEN 'LAA'
001284             MOVE 'NYL ACCESS VA' TO RP-PRODUCT-NAME
001285         WHEN 'LDA'
001286             MOVE 'NYL COMPLETE ACCESS VA' TO RP-PRODUCT-NAME
001287         WHEN 'LD2'
001288             MOVE 'NYL COMPLETE ACCESS VA II' TO RP-PRODUCT-NAME
001289         WHEN 'LRA'
001290             MOVE 'NYL ELITE VA' TO RP-PRODUCT-NAME
001291         WHEN 'LCA'
001292             MOVE 'NYL ESSENTIALS VA' TO RP-PRODUCT-NAME
001293         WHEN 'NVA'
001294         WHEN 'NWA'
001295             MOVE 'NYL FLEXIBLE PREMIUM VA' TO RP-PRODUCT-NAME
001296         WHEN 'LIA'
001297         WHEN 'LJA'
001298             MOVE 'NYL FLEXIBLE PREMIUM VA II' TO RP-PRODUCT-NAME
001299         WHEN 'LI2'
001300         WHEN 'LJ2'
001301             MOVE 'NYL FLEXIBLE PREMIUM VA III' TO RP-PRODUCT-NAME
001302         WHEN 'LKA'
001303             MOVE 'NYL INCOME PLUS VA' TO RP-PRODUCT-NAME
001304         WHEN 'LK2'
001305             MOVE 'NYL INCOME PLUS VA II' TO RP-PRODUCT-NAME
001306         WHEN 'LGA'
001307             MOVE 'NYL LONGEVITY BENEFIT VA' TO RP-PRODUCT-NAME
001308         WHEN 'LTA'
001309         WHEN 'LYA'
001310             MOVE 'NYL PREMIER PLUS VA' TO RP-PRODUCT-NAME
001311         WHEN 'LT2'
001312         WHEN 'LY2'
001313             MOVE 'NYL PREMIER PLUS VA II' TO RP-PRODUCT-NAME
001314         WHEN 'LUA'
001315         WHEN 'LFA'
001316             MOVE 'NYL PREMIER VA' TO RP-PRODUCT-NAME
001317         WHEN 'LU2'
001318         WHEN 'LF2'
001319             MOVE 'NYL PREMIER VA II' TO RP-PRODUCT-NAME
001320         WHEN 'LEA'
001321             MOVE 'NYL PREMIUM PLUS ELITE VA' TO RP-PRODUCT-NAME
001322         WHEN 'LBA'
001323         WHEN 'LPA'
001324             MOVE 'NYL PREMIUM PLUS VA' TO RP-PRODUCT-NAME
001325         WHEN 'LLA'
001326             MOVE 'NYL SELECT VA' TO RP-PRODUCT-NAME
001327         WHEN 'LSA'
001328             MOVE 'NYL VA' TO RP-PRODUCT-NAME
001329         WHEN 'ASU'
001330         WHEN 'BSU'
001331         WHEN 'CSU'
001332             MOVE 'PINNACLE SURVIVORSHIP UL' TO RP-PRODUCT-NAME
001333         WHEN 'AUL'
001334         WHEN 'BUL'
001335         WHEN 'CUL'
001336             MOVE 'PINNACLE UL' TO RP-PRODUCT-NAME
001337         WHEN 'ASV'
001338         WHEN 'BSV'
001339         WHEN 'CSV'
001340             MOVE 'PINNACLE SURVIVORSHIP VUL' TO RP-PRODUCT-NAME
001341         WHEN 'AVU'
001342         WHEN 'BVU'
001343         WHEN 'CVU'
001344             MOVE 'PINNACLE VUL' TO RP-PRODUCT-NAME
001345         WHEN 'SP8'
001346             MOVE 'NYL LEGACY CREATOR SPVUL' TO RP-PRODUCT-NAME
001347         WHEN 'VLW'
001348             MOVE 'NYL LIFETIME WEALTH VUL' TO RP-PRODUCT-NAME
001349         WHEN 'S8A'
001350             MOVE 'NYL SURVIVORSHIP VUL ACCUMULATOR'
001351                 TO RP-PRODUCT-NAME
001352         WHEN 'V8A'
001353             MOVE 'NYL VUL ACCUMULATOR' TO RP-PRODUCT-NAME
001354         WHEN 'V18'
001355             MOVE 'NYL VUL ACCUMULATOR II' TO RP-PRODUCT-NAME
001356         WHEN 'V8P'
001357             MOVE 'NYL VUL ACCUMULATOR PLUS' TO RP-PRODUCT-NAME
001358         WHEN 'SPE'
001359         WHEN 'SPV'
001360             MOVE 'NYL SINGLE PREMIUM VUL' TO RP-PRODUCT-NAME
001361         WHEN 'SVE'
001362         WHEN 'SVL'
001367             MOVE 'NYL SINGLE PREMIUM VUL' TO RP-PRODUCT-NAME
001368         WHEN 'SVE'
001369         WHEN 'SVL'
001370             MOVE 'NYL SURVIVORSHIP VUL' TO RP-PRODUCT-NAME
001371         WHEN 'VUL'
001372             MOVE 'NYL VUL' TO RP-PRODUCT-NAME
001373         WHEN 'V2E'
001374         WHEN 'V2K'
001375             MOVE 'NYL VUL 2000' TO RP-PRODUCT-NAME
001376         WHEN 'VDC'
001377             MOVE 'NYL VUL PROVIDER' TO RP-PRODUCT-NAME
001378         WHEN OTHER
001379             MOVE FCVBASE-BASE TO RP-PRODUCT-NAME
001380     END-EVALUATE.

001381 P200-PROCESS-SEG-02-EXIT.
001382     EXIT.
001383     EJECT

001384 ******************************************************************
001385 *                  GET USER INFO - 52 - SEGMENT
001386 ******************************************************************

001387 P200-PROCESS-SEG-52.
001388     MOVE +0  TO WS-SEG-SEQ.
001389     MOVE '52' TO WS-SEG-ID.

001390     PERFORM SUB7000-GET-TRLR
001391         THRU SUB7999-GET-TRLR-EXIT.

001392     IF WS-IO-CODE IS NOT EQUAL TO '0'
001393         GO TO P200-PROCESS-SEG-52-EXIT
001394     END-IF.

001395     MOVE WS-SEG-WORK-AREA TO USER-SEGMENT.

001396 P200-PROCESS-SEG-52-EXIT.
001397     EXIT.

001398 ******************************************************************
001399 *              PROCESS LIFE CONTROL SEGMENT -- 89
001400 ******************************************************************

001401 P400-PROCESS-SEG-89.
001402     MOVE +0 TO WS-89SEG-SEQ.
001403     MOVE '89' TO WS-89SEG-ID.
001404     MOVE +0 TO WS-89CTR.

001405 P420-PROCESS-NEXT-89.

001406     PERFORM SUB7000-GET-89TRLR
001407         THRU SUB7999-GET-89TRLR-EXIT.

001408     IF WS-IO-CODE IS NOT EQUAL TO '0'
001409         GO TO P400-PROCESS-SEG-89-EXIT
001410     END-IF.

001411     INITIALIZE WS-EXT-CEASE-DATE
001412                WS-EXT-DOD-DATE.

001413     CALL 'CKDCINEX' USING FLCCSEDT-CEASE-DATE
001414                           WS-EXT-CEASE-DATE.

001415     CALL 'CKDCINEX' USING FLCDHDAT-DATE-OF-DEATH
001416                           WS-EXT-DOD-DATE.

001417     IF WS-EXT-CEASE-DATE IS NUMERIC OR
001418        WS-EXT-DOD-DATE   IS NUMERIC
001419         GO TO P420-PROCESS-NEXT-89
001420     END-IF.

001421     IF WS-89CTR > +05
001422         GO TO P400-PROCESS-SEG-89-EXIT
001423     END-IF.

001424     IF FLCPERSN-OWNER
001425         ADD +1 TO WS-89CTR
001426         IF FLCLVERN-NAME-DATA
001427             STRING FLCFNAME-FIRST-NAME  DELIMITED BY SPACE
001428                    SPACE
001429                    FLCMINIT-MID-INITIAL DELIMITED BY SPACE
001430                    SPACE
001431                    FLCLNAME-LAST-NAME   DELIMITED BY SPACE
001432                INTO RP-OWNER-NAME (WS-89CTR)
001433             END-STRING
001434         ELSE
001435             MOVE FLCCORP-CORPORATION
001436                 TO RP-OWNER-NAME (WS-89CTR)
001437         END-IF

001438         STRING FNALINE1 DELIMITED BY SPACE
001439                SPACE
001440                FNACITY  DELIMITED BY SPACE
001441                SPACE
001442                WS-OWN-STATE DELIMITED BY SPACE
001443                SPACE
001444                WS-OWN-ZIP-CODE DELIMITED BY SPACE
001445            INTO RP-OWNER-ADDR
001446         END-STRING

001447         INSPECT RP-OWNER-NAME (WS-89CTR)
001448             REPLACING ALL ',' BY SPACE
001449     END-IF.

001450     GO TO P420-PROCESS-NEXT-89.

001451 P400-PROCESS-SEG-89-EXIT.
001452     EXIT.
001459     END-IF.

001460     GO TO P420-PROCESS-NEXT-89.

001461 P400-PROCESS-SEG-89-EXIT.
001462     EXIT.
001463     EJECT

001464 ******************************************************************
001465 *             THIS ROUTINE WILL GET THE 89 SEGMENT.
001466 ******************************************************************

001467 SUB7000-GET-89TRLR.

001468     ADD +1 TO WS-89SEG-SEQ.

001469     CALL 'CKETRGET' USING WS-89SEG-ID
001470                           WS-89SEG-SEQ
001471                           INQUIRY-LIFE-CNTL-SEGMENT
001472                           WS-DUMMY
001473                           WS-IO-CODE
001474                           WS-DUMMY
001475                           INFORCE-FILE-DCB.

001476 SUB7999-GET-89TRLR-EXIT.
001477     EXIT.
001478     EJECT

001479 ******************************************************************
001480 *             THIS ROUTINE WILL GET A SEGMENT.
001481 ******************************************************************

001482 SUB7000-GET-TRLR.

001483     ADD +1 TO WS-SEG-SEQ.
001484     INITIALIZE WS-SEG-WORK-AREA.

001485     IF HISTORY-FILE
001486         CALL 'CKETRGET' USING WS-SEG-ID
001487                               WS-SEG-SEQ
001488                               WS-SEG-WORK-AREA
001489                               WS-DUMMY
001490                               WS-IO-CODE
001491                               WS-DUMMY
001492                               HISTORY-FILE-DCB
001493     END-IF.

001494     IF INFORCE-FILE
001495         CALL 'CKETRGET' USING WS-SEG-ID
001496                               WS-SEG-SEQ
001497                               WS-SEG-WORK-AREA
001498                               WS-DUMMY
001499                               WS-IO-CODE
001500                               WS-DUMMY
001501                               INFORCE-FILE-DCB
001502     END-IF.

001503 SUB7999-GET-TRLR-EXIT.
001504     EXIT.
001505     EJECT

001506 ******************************************************************
001507 *                PROCESS PVE EXTRACT FILE
001508 ******************************************************************

001509 ******************************************************************
001510 *                     BATCH IO ROUTINE
001511 ******************************************************************

001512 SUB4000-IOROUTINE.

001513     CALL 'CKBATCHC' USING BCHCODES-CALLING-FILE
001514                           BCHCODES-CALLING-RETURN
001515                           OFFLINE-RECORD
001516                           RECORD-LENGTH.

001517     IF BCHCODES-CALLING-RETURN NOT EQUAL
001518        BCHNORM-NORMAL-RETURN AND
001519        BCHEOF-END-OF-FILE

001520         DISPLAY MSG01-IO-ERROR
001521                 SPACE
001522                 BCHCODES-CALLING-FILE
001523                 SPACE
001524                 BCHCODES-CALLING-RETURN

001525         CALL 'CKCOBCLS'
001526         CALL 'CKABEND'
001527     END-IF.

001528 SUB4999-IO-ROUTINE-EXIT.
001529     EXIT.
001530     EJECT

001531 ******************************************************************
001532 *                         READ ACF FILE
001533 ******************************************************************

001534 2200-READ-ACF.

001535 2200-READ-ACF-EXIT.
001536     EXIT.
001537     EJECT
