000001  IDENTIFICATION DIVISION.
000002  PROGRAM-ID. NYFPOWAG.
000003  AUTHOR. BHARATH.
000004  DATE-WRITTEN. 02/2020.
000005  ENVIRONMENT DIVISION.
000006  CONFIGURATION SECTION.
000007  INPUT-OUTPUT SECTION.
000008  FILE-CONTROL.
000009      SELECT PVERESP-EXTRACT-FILE ASSIGN TO PVERESP.
000010  DATA DIVISION.
000011  FILE SECTION.

000013  FD  PVERESP-EXTRACT-FILE
000014      LABEL RECORDS ARE STANDARD
000015      RECORDING MODE IS F
000016      BLOCK CONTAINS 0 RECORDS
000017      RECORD CONTAINS 93 CHARACTERS.
000018  01  PVERESP-EXTRACT-RECORD        PIC X(93).

**********************************************************************
*A        ABSTRACT..
*         FILEPASS IS NEEDED FOR SEC REQUEST.
*
*J        JCL..
*
//NYF708VA EXEC PGM=NYF708VA,TIME=30,REGION=8M
//SEQUEN1  DD  DISP=(,CATLG),
//             UNIT=TEMP,SPACE=(CYL,(20,20),RLSE),
//             DCB=(RECFM=FB,LRECL=400,BLKSIZE=0),
//             DSN=T54.NYF708VA.PROD.DATA
//VSAM2    DD  DISP=SHR,DSN=P54.CK.BASEB.POLICY
//FVDSEG1  DD  DISP=SHR,DSN=P54.CK.BASEB.AUXSEG1
//FVDULHD  DD  DISP=SHR,DSN=P54.CK.BASEB.HISTORY
//FVDSEGH  DD  DISP=SHR,DSN=P54.CK.BASEB.AUXSEGH
//SYSOUT   DD  SYSOUT=*
//SYSABEND DD  SYSOUT=*
//ABNLDUMP DD  DUMMY
//SYSPDDMP DD  SYSOUT=*
//SYSUDUMP DD  SYSOUT=*
*
*P        ENTRY PARAMETERS..
*         NONE.
*
*E        ERRORS DETECTED BY THIS ELEMENT..
*         I/O ERROR ON FILES
*
*C        ELEMENTS INVOKED BY THIS ELEMENT..
*         CKVSAMIO ---- VSAM I/O INTERFACE
*         CKABEND  ---- FORCE A PROGRAM INTERUPT
*         CKETRLST ---- TRAILER LIST ELEMENT
*         CKETRGET ---- TRAILER GET  ELEMENT
*         CKSDTIO  ---- AUX SEGMENT TABLE INTERFACE
*         CKSDTXIO ---- AUXH SEGMENT TABLE INTERFACE
*         CKUBHSIO ---- HISTORY FILE I/O
*         CKSETADR ---- SET ADDRESS
*         CKCOBCRD ---- PRINT ELEMENT
*         CKDCEXIN ---- DATE CONVERSION
*         CKBITBYT ---- BIT TO BYTE CONVERSION
*         CKDCINEX ---- DATE CONVERSION
*         CKBATCHC ---- SEQUENTIAL FILE I/O
*
*U        USER CONSTANTS AND TABLES REFERENCED..
*         NONE
*
**********************************************************************

        EJECT
        WORKING-STORAGE SECTION.
000073  01  FILLER                     PIC X(32)
000074      VALUE 'NYF708VA WORKING STORAGE BEGINS '.

**********************************************************************
*                         DATA AREAS
**********************************************************************

        COPY CKRECMAX.
        EJECT

**********************************************************************
*                     READ ONLY CONSTANTS
**********************************************************************

000084  01  READ-ONLY-WORK-AREA.
000085      05  HWORD            COMP  PIC S9(04) VALUE +7.
000086      05  BINARY-3         COMP  PIC S9(04) VALUE +3.
000087      05  BINARY-7         COMP  PIC S9(04) VALUE +7.
000088      05  WS-DUMMY                PIC X     VALUE SPACE.
000089      05  WS-AGENT-CHK            PIC X(10).
000090          88  AGENT-PRESENT       VALUE '193136'.
000091      05  MISC-CONSTANTS.
000092          10  CONSTANT-89         PIC S9(4) VALUE +089 COMP.
000093          10  WS-HEX-VALUES       PIC S9(13) COMP-3
000094              VALUE +0001020304050.
000095          10  WS-HEX-TABLE REDEFINES WS-HEX-VALUES.
000096              15  HEX-00          PIC X.
000097              15  HEX-01          PIC X.
000098              15  HEX-02          PIC X.
000099              15  HEX-03          PIC X.
000100              15  HEX-04          PIC X.
000101              15  HEX-05          PIC X.
000102              15  FILLER          PIC X VALUE SPACE.
000103      05  WS-OTHER-DUMMY          PIC X.
000104      05  BINARY1         COMP    PIC S9(04) VALUE +1.

000105      05  INFORCE-VSAM             PIC X(8)  VALUE 'VSAM2'.
000106      05  HISTORY-VSAM             PIC X(8)  VALUE 'VSAMX'.
000107      05  ACF-FILE-NAME            PIC X(19).
000108      05  MSG01-IO-ERROR
000109              VALUE 'I/O ERROR ON FILE - '.
000110      VALUE 'I/O ERROR ON FILE - '.

000112  * SWITCHES AREA
000113  ***NYRBNFOR TABLE AREA
000114      05 END-OF-FILE-INDICATOR        PIC X(1).
000115         88 END-OF-FILE                VALUE 'Y'.
000116      05 RIDER-IND                     PIC X(1).
000117         88 RIDER-FOUND                VALUE 'Y'.
000118      05 WS-RECORD-IND                 PIC X(1).
000119         88 INFORCE-RECORD             VALUE 'I'.
000120      05 CONTINUE-PROCESSING-INDICATOR PIC X(1).
000121         88 CONTINUE-PROCESSING        VALUE 'Y'.
000122         88 END-OF-PROCESSING          VALUE 'N'.
000123      05 RMD-PPW-IND                   PIC X(1).
000124         88 RMD-PPW                     VALUE 'Y'.
000125      05 AWD-TRANS-IND                 PIC X(1).
000126         88 AWD-TRANS-FOUND            VALUE 'Y'.
000127         88 AWD-TRANS-NOT-FOUND        VALUE 'N'.
000128      05 END-OF-TABLE-INDICATOR        PIC X(1).
000129         88 END-OF-TABLE               VALUE 'Y'.
000130         88 CONTINUE-LOADING           VALUE 'N'.
000131      05 PREM-TRANS-IND                PIC X(1).
000132         88 PREMS-FOUND                VALUE 'Y'.
000133         88 PREMS-NOT-FOUND            VALUE 'N'.

000134      05 WS-EFT-FOUND                  PIC X(01).
000135         88 EFT-FOUND                  VALUE 'Y'.
000136         88 EFT-NOT-FOUND              VALUE 'N'.
000137      05 MNTHLY-PORCESS-IND            PIC X(1).
000138         88 MNTHLY-YET-PROCESS         VALUE 'Y'.
000139      05 SEMIANNUAL-PORCESS-IND        PIC X(1).
000140         88 SEMIANNUAL-YET-PROCESS     VALUE 'Y'.
000141      05 ANNUAL-PORCESS-IND            PIC X(1).
000142         88 ANNUAL-YET-PROCESS         VALUE 'Y'.
000143      05 PPW-IND                       PIC X(01).
000144         88 PPW-QUALIFY                VALUE 'Y'.
000145         88 PPW-NOT-QUALIFY            VALUE 'N'.
000146      05 ADDL-PREM-IND                 PIC X(1).
000147         88 ADDL-PREM-MADE             VALUE 'Y'.
000148         88 ADDL-PREM-NOT-MADE         VALUE 'N'.
000149      05 WS-NP-ACTIVE-FUND-SW          PIC X(01).
000150         88 WS-NP-ACTIVE-FUND-NO       VALUE 'N'.
000151         88 WS-NP-ACTIVE-FUND-YES      VALUE 'Y'.
000152      05 END-OF-FILE-PVE-INDICATOR     PIC X(1).
000153         88 END-OF-FILE-PVE            VALUE 'Y'.
000154      05 PPW-STATUS-IND                PIC X(1).
000155         88 PPW-FOUND                  VALUE 'Y'.
000156         88 PPW-NOT-FOUND              VALUE 'N'.

000158      05 WS-PPW-IND                    PIC X(1).
000159         88 PPW-FND                    VALUE 'Y'.
000160         88 PPW-N-FND                  VALUE 'N'.

000162      05 WS-AGENT-ACTIVE               PIC X(01).
000163         88 ACTV-AGNT-FOUND            VALUE 'Y'.
000164         88 AGENT-NOT-ACTIVE           VALUE 'N'.
000165      05 CT-STATE-IND                  PIC X(1).
000166         88 CT-STATE-FOUND             VALUE 'Y'.
000167         88 CT-STATE-NOT-FOUND         VALUE 'N'.
000168      05 MAT-DT-CHECK-IND              PIC X(1).
000169         88 MAT-DATE-FOUND             VALUE 'Y'.
000170         88 MAT-DATE-NOT-FOUND         VALUE 'N'.
000171      05 GFIR-IND                      PIC X(1).
000172         88 GFIR-IND-FOUND             VALUE 'Y'.
000173         88 GFIR-IND-NOT-FOUND         VALUE 'N'.
000174      05 NEW-MAT-DT-IND                PIC X(1).
000175         88 NEW-MAT-DT-FOUND           VALUE 'Y'.
000176         88 NEW-MAT-DT-NOT-FOUND       VALUE 'N'.
000177      05 WSP-RIDER-IND                 PIC X(1).
000178         88 WSP-IND-FOUND              VALUE 'Y'.
000179         88 WSP-IND-NOT-FOUND          VALUE 'N'.
000180      05 WS-FILE-IND                   PIC X(1).
000181         88 INFORCE-FILE               VALUE 'I'.
000182         88 HISTORY-FILE               VALUE 'H'.

000183      05 WS-SAVE-PLAN                  PIC X(11).
000184  *   05 WS-TEMP-POLICY               PIC X(10).
000185      05 CHECK-TRANS-TYPE              PIC X(02).
000186         88 PRTL-WTHDRL VALUES
000187             'SH', 'SN', 'SG', 'SM',
000188             'SA', 'SV', 'SW', 'ST'.

000189      05 PRTL-WDRWL-IND                PIC X(01).
000190         88 PRTL-WTHDRL-FOUND          VALUES 'Y'.
000191         88 PRTL-WTHDRL-NOT-FOUND      VALUES 'N'.

000194      05 CHECK-TRANS-COUNT             PIC X(02).
000195         88 FULL-SURRENDER             VALUES 'SF'.
000196         88 TERM-DEATH                 VALUES 'TD'.
000197         88 INIT-PAYMENT               VALUES 'PI', 'PF'.
000198         88 ALL-PREM-PAYMENT           VALUES 'PI', 'PF', 'PA', 'PR',
000199                                           'PT', 'PU', 'PB'.
000200         88 ADDTL-PAYMENT              VALUES 'PA'.
000201         88 REG-PAYMENT                VALUES 'PR'.
000202         88 REINST-PAYMENT             VALUES 'PU', 'PB'.
000203         88 LOAN-PAYMENT               VALUES 'LN', 'LM', 'LG'.

000205      05 SURR-DEATH-TERM-IND           PIC X(01).
000206         88 IS-SURRENDER               VALUES 'S'.
000207         88 IS-TERM-DEATH              VALUES 'T'.
000208         88 UNKNOWN                    VALUES ' '.

000211  *   05 POLICY-FOUND-IND              PIC X(01).
000212  *      88 POLICY-FOUND               VALUES 'Y'.
000213  *      88 POLICY-NOT-FOUND           VALUES 'N'.

000214      05 CHECK-CURR-STATE              PIC X(02).
000215  *   05 PROCESS-POLICY-IND            PIC X(01).
000216  *      88 PROCESS-POLICY             VALUES 'Y'.
000217  *      88 DO-NOT-PROCESS             VALUES 'N'.

000219  *   05 PROCESS-POLICY-IND            PIC X(01).
000220  *      88 WRITE-RECORD               VALUES 'Y'.
000221  *      88 DONT-WRITE-RECORD          VALUES 'N'.

000223  * I-O READ ONLY DATA
000224      05 WS-IO-CODE                    PIC X(1).
000225         88 OPEN-INFORCE-FOR-UPDATE    VALUE '1'.
000226         88 CLOSE-INFORCE-FILE         VALUE '5'.
000227         88 SETL-INFORCE-FILE          VALUE '7'.
000228         88 READ-INFORCE-FOR-UPDATE    VALUE '8'.
000228         88 SETL-INFORCE-FILE        VALUE '7'.
000229         88 READ-INFORCE-FOR-UPDATE  VALUE '8'.
000230         88 REWRITE-INFORCE-FILE     VALUE '4'.
000231         88 INFORCE-IO-COMPLETED     VALUE '0'.
000232         88 INFORCE-IO-EOF           VALUE '6'.
000233         88 INFORCE-IO-FAILED        VALUE '1' THRU '5'
000234                                     '7' THRU '9'.

000235  * INFORCE READ ONLY DATA
000236      05 INFORCE-FILE-LENGTH      COMP SYNC PIC S9(4) VALUE +12.
000237      05 INF-RECORD-KEY.
000238          10 INFORCE-KEY-FILE-CODE  PIC X.
000239          10 INFORCE-KEY-USER-ID    PIC X.
000240          10 INFORCE-KEY-POL-NUM    PIC X(10).

000242      05 INFORCE-BASIC-LENGTH    COMP SYNC PIC S9(4).
000243      05 INFORCE-RECSIZE         COMP PIC S9(8) VALUE +65000.
000244      05 FILLER REDEFINES INFORCE-RECSIZE.
000245          10 FILLER              PIC X(2).
000246          10 INFORCE-PRMAX       COMP PIC 9(4).
000247      05 INFORCE-MAX-SEGS        COMP PIC S9(4) VALUE +4000.

000249  * HISTORY READ ONLY DATA
000250      05 SDT-H-TABLE-NAME        PIC X(08) VALUE 'CKESDTBH'.
000251      05 HISTORY-REC-CTL-LEN     COMP PIC S9(4) VALUE +20.

000253      05 INFORCE-VSAMX-INFO.
000254          10 FILLER              PIC X(7) VALUE 'FVDUNLD'.
000255          10 FILLER              PIC X VALUE LOW-VALUE.
000256          10 FILLER              PIC X VALUE ' '.
000257          10 FILLER              PIC X(08) VALUE LOW-VALUES.

000259      05 HISTORY-VSAMX-INFO.
000260          10 FILLER              PIC X(7) VALUE 'FVDULHD'.
000261          10 FILLER              PIC X VALUE LOW-VALUE.
000262          10 FILLER              PIC X VALUE ' '.
000263          10 FILLER              PIC X(11) VALUE LOW-VALUES.

000264      EJECT

000266  01 LOAD-PREM-GROSS-AMNT.
000267      05 WS-GROSS-AMNT-REC OCCURS 10 TIMES.
000268          10 WS-GROSS-AMNT  PIC S9(9)V99 COMP-3.

000270  01 CKUDT103-ENTRY.
000271      05 CKUDT103-ALPHA-STATE     PIC XX.
000272      05 CKUDT103-NUMERIC-STATE   PIC 9(02).
000273      EJECT

000274  01 TABLE-PARMS.
000275      COPY CKTBPARM.
000276      EJECT

000278  01 LOAD-PLAN-DESC-TABLE.
000279      05 WS-PLANDESC-REC OCCURS 600 TIMES.
000280          10 WS-PLAN-NAME     PIC X(11).
000281          10 WS-PLAN-DESC     PIC X(78).
000282          10 FILLER           PIC X(14).
000283      EJECT

***********************************************************************
*                        VARIABLE DATA AREAS                          *
***********************************************************************

000287  01 WS-PVERESP-EXTRACT.
000288      05 PVE-CONTRACT-ID      PIC X(08).
000289      05 FILLER               PIC X(17).
000290      05 FILLER               PIC X(19).
000291      05 PVE-CALC-CD          PIC X(03).
000292      05 PVE-CALC-NUM REDEFINES PVE-CALC-CD PIC 9(03).
000293      05 FILLER               PIC X(03).
000294      05 PVE-CALC-VALUE       PIC --------9.99.
000295      05 FILLER               PIC X(02).
000296      05 PVE-AS-OF-DATE       PIC X(02) VALUE SPACES.
000297          10 PVE-AS-OF-MONTH  PIC X(02) VALUE SPACES.
000298          10 SLASH-1          PIC X(01) VALUE '/'.
000299          10 PVE-AS-OF-DAY    PIC X(02) VALUE SPACES.
000300          10 SLASH-2          PIC X(01) VALUE '/'.
000301          10 PVE-AS-OF-YEAR   PIC X(04) VALUE SPACES.
000302      05 FILLER               PIC X(13).

***********************************************************************
*                        VARIABLE DATA AREAS                          *
***********************************************************************

000306  01 VARIABLE-WORK-AREA.
000307      05 RECORD-LENGTH            PIC S9(8) COMP.
000308      05 HISTORY-FILE-LENGTH COMP PIC S9(4).
000309      05 WS-HIGH-DURATION   COMP-3 PIC S9(5) VALUE +0.
000310      05 WS-LOW-DURATION    COMP-3 PIC S9(5) VALUE +0.
000311      05 WS-HISTORY-RCD-CNT COMP-3 PIC S9(3) VALUE +0.
000312      05 WS-MULTIPLE-DURATION-IND PIC X(01).
000313          88 CHECK-MULTIPLE-DURATION-RECS VALUE 'Y'.

000315      05 WS-AGT-KEY.
000316          10 WS-AGT-KEY-REC-ID PIC X(01).
000317          10 WS-AGT-KEY-USER   PIC X(01).
000318          10 WS-AGT-KEY-AGENT  PIC X(10).

000319      05 WS-ACF-LENGTH-PARAM PIC S9(4) COMP.
000320      05 WS-AGT-SEQ      COMP-3 PIC S9(5).
000321      05 WS-AGT-ID            PIC X(02).
000322      05 WS-69CTR             PIC S9(9) COMP-3.
000323      05 WS-04-CTR            PIC S9(4) COMP-3.
000324      05 WS-48CTR             PIC S9(9) COMP-3.
000325      05 WS-CTR               PIC S9(9) COMP-3.
000326      05 WS-89CTR             PIC S9(9) COMP-3.
000327      05 WS-OCTR              PIC S9(9) COMP-3.
000328      05 WS-FLCSEQ-SEQUENCE   PIC X(01).
000329      05 WS-ACF-IO-BYTE       PIC X.
000330      05 WS-PCTR              PIC S9(9) COMP-3.
000331      05 WS-PREM-GROSS-AMNT   PIC S9(09)V99 COMP-3.
000332      05 WS-RECEIPNT-ADDR     PIC X(100) VALUE SPACE.
000333      05 WS-FLC-SEQ           PIC X(01).
000334      05 WS-AGENT-ID          PIC X(10).
000335      05 WS-AGENT-NAME        PIC X(40).
000336      05 WS-AGENT-COMM        PIC 9(04).
000337      05 WS-AGENT-STATUS      PIC X(06).
000338      05 WS-ISSUE-AGE         PIC S9(03) COMP-3.
000339      05 WS-COMP-VAR55        PIC S9(03) COMP-3.
000340      05 WS-ISSUE-STATE       PIC X(02).
000341      05 WS-ERROR-MSG         PIC X(50).
000342      05 COMP-ISSUE-AGE       PIC S9(03) COMP-3.
000343      05 WS-SUB               PIC S9(04) COMP-3 VALUE 0.
000344      05 WS-SUB-SAVE          PIC S9(04) COMP-3 VALUE 0.
000342      05 COMP-ISSUE-AGE         PIC S9(03) COMP-3.
000343      05 WS-SUB                 PIC S9(04) COMP-3 VALUE 0.
000344      05 WS-SUB-SAVE            PIC S9(04) COMP-3 VALUE 0.
000345      05 WS-SEG-ID              PIC X(02).
000346      05 WS-STATUS              PIC X(02).
000347      05 WS-FATCA-IND           PIC X(1).
000348      05 WS-FATCA-STATUS        PIC X(12).
000349      05 WS-FACE-AMT            PIC S9(9)V99 COMP-3.
000350      05 WS-INIT-PREM           PIC S9(9)V99 COMP-3.
000351      05 WS-GROSS-INIT-PREM     PIC S9(9)V99 COMP-3.
000352      05 WS-GROSS-TOT-AMNT      PIC S9(9)V99 COMP-3.
000353      05 WS-CUMM-AMT            PIC S9(09)V99 COMP-3.
000354      05 WS-GROSS-RECURING-PREM PIC S9(9)V99 COMP-3.
000355      05 WS-AD-PLAN             PIC X(05).
000356      05 WS-52SEG-ID            PIC X(02).
000357      05 WS-02SEG-ID            PIC X(02).
000358      05 WS-89SEG-ID            PIC X(02).
000359      05 WS-ADDR                PIC X(90).
000360      05 WS-CITY                PIC X(30).
000361      05 WS-STATE               PIC X(2).
000362      05 WS-ZIP-CODE            PIC X(13).
000363      05 WS-90SEG-ID            PIC X(02).
000364      05 WS-PLAN-BASE           PIC X(03).
000365      05 WS-PLAN-TYPE           PIC X(01).
000366      05 WS-SEG-SEQ      COMP-3 PIC S9(5).
000367      05 WS-52SEG-SEQ    COMP-3 PIC S9(5).
000368      05 WS-02SEG-SEQ    COMP-3 PIC S9(5).
000369      05 WS-89SEG-SEQ    COMP-3 PIC S9(5).
000370      05 WS-90SEG-SEQ    COMP-3 PIC S9(5).
000371      05 WS-SEG-WORK-AREA       PIC X(25000) VALUE SPACE.

000373  * DATA AREA
000374      05 AGENT-SUB              PIC S9(4) COMP.
000375      05 WS-ASOF-TD-DATE        PIC X(04).
000376      05 WS-EXT-ASOF-DATE       PIC X(08).
000377      05 WS-EXT-ENTRY-DATE      PIC X(08).

000378      05 WS-CNTR                PIC S9(3) COMP-3.
000379      05 WS-OWNR-EFF-CMPR-DATE  COMP-3.
000380          10 WS-OWNR-EFF-CMPR-MMYY PIC S9(3).
000381          10 WS-OWNR-EFF-CMPR-DD   PIC S9(3).

000382      05 WS-OWNER-TBL OCCURS 6 TIMES.
000383          10 WS-OWNR-EFF-DATE COMP-3.
000384              15 WS-OWNR-EFF-MMYY PIC S9(3).
000385              15 WS-OWNR-EFF-DD   PIC S9(3).

000387      05 WS-MMYEAR-CODE-DATE COMP-3.
000388          10 WS-MMYEAR-CODE-YEAR PIC S9(05).
000389          10 WS-MMYEAR-CODE-DAY  PIC S9(03).

000391      05 WS-30DAY-CORR-MAT-DATE.
000392          10 WS-30D-CORR-MM   PIC X(02).
000393          10 WS-30D-CORR-DD   PIC X(02).
000394          10 WS-30D-CORR-YYYY PIC X(04).

000396      05 WS-INT-BACK-DATE COMP-3.
000397          10 WS-INT-BACK-MMYY PIC S9(03).
000398          10 WS-INT-BACK-DD   PIC S9(03).

000400      05 WS-INT-NEXT-DATE COMP-3.
000401          10 WS-INT-NEXT-MMYY PIC S9(03).
000402          10 WS-INT-NEXT-DD   PIC S9(03).

000404      05 WS-INT-NEXT-DATE2 COMP-3.
000405          10 WS-INT-NEXT-MMYY2 PIC S9(03).
000406          10 WS-INT-NEXT-DD2   PIC S9(03).

000408      05 WS-60DAY-CORR-MAT-DATE.
000409          10 WS-60D-CORR-MM   PIC X(02).
000410          10 WS-60D-CORR-DD   PIC X(02).
000411          10 WS-60D-CORR-YYYY PIC X(04).

000413      05 WS-90DAY-CORR-MAT-DATE.
000414          10 WS-90D-CORR-MM   PIC X(02).
000415          10 WS-90D-CORR-DD   PIC X(02).
000416          10 WS-90D-CORR-YYYY PIC X(04).

000418      05 WS-EFFECTIVE-DATE.
000419          10 WS-EFFECTIVE-MM   PIC 9(02).
000420          10 WS-EFFECTIVE-DD   PIC 9(02).
000421          10 WS-EFFECTIVE-YYYY PIC 9(04).

000423      05 WS-EXT-DATE.
000424          10 WS-EXT-MM   PIC 9(02).
000425          10 WS-EXT-DD   PIC 9(02).
000426          10 WS-EXT-YYYY PIC 9(04).

000428      05 WS-BIRTH-DATE.
000429          10 WS-BRTH-MM   PIC 9(02).
000430          10 WS-BRTH-DD   PIC 9(02).
000431          10 WS-BRTH-YYYY PIC 9(04).

000433      05 WS-POL-INFORCE-DATE.
000434          10 WS-POL-INFORCE-MM   PIC X(02) VALUE SPACE.
000435          10 WS-POL-INFORCE-DD   PIC X(02) VALUE SPACE.
000436          10 WS-POL-INFORCE-YYYY PIC X(04) VALUE SPACE.

000438      05 WS-POL-RECEIPT-DATE.
000439          10 WS-POL-RECEIPT-MM   PIC X(02) VALUE SPACE.
000440          10 WS-POL-RECEIPT-DD   PIC X(02) VALUE SPACE.
000441          10 WS-POL-RECEIPT-YYYY PIC X(04) VALUE SPACE.

000443      05 WS-EXT-CEASE-DATE      PIC X(08) VALUE SPACE.

000445      05 WS-CKDCARTH-CONTANTS   PIC S9(3) COMP-3.
000446          10 DCARTH-MONTHS      PIC S9(3) COMP-3.
000447          10 DCARTH-DAYS        PIC S9(3) COMP-3.
000448          10 DCARTH-YEARS       PIC S9(3) COMP-3.
000449          10 WS-DCARTH-ADD        PIC X VALUE '0'.
000450          10 WS-DCARTH-SUBTRACTION PIC X VALUE '1'.
000451          10 WS-DCARTH-DIFFERENCE  PIC X VALUE '2'.

000452      05 WS-EXT-DOD-DATE        PIC X(08) VALUE SPACE.
000452      05 WS-EXT-DOD-DATE            PIC X(08) VALUE SPACE.

000454      05 WS-EFF-DATE                COMP-3.
000455          10 WS-EFF-MMYY            PIC S9(3).
000456          10 WS-EFF-DD              PIC S9(3).

000457      05 WS-INIT-START-DATE.
000458          10 WS-INIT-START-MOYR     PIC S9(05) COMP-3.
000459          10 WS-INIT-START-DAY      PIC S9(03) COMP-3.

000461      05 WS-NEXT-WTHDRWL-DATE.
000462          10 WS-NEXT-SCHD-MM        PIC X(02) VALUE SPACE.
000463          10 WS-NEXT-SCHD-DD        PIC X(02) VALUE SPACE.
000464          10 WS-NEXT-SCHD-YYYY      PIC X(04) VALUE SPACE.

000466      05 WS-EXT-START-DATE.
000467          10 WS-EXT-START-MM        PIC 9(02).
000468          10 WS-EXT-START-DD        PIC 9(02).
000469          10 WS-EXT-START-YYYY      PIC 9(04).

000471      05 WS-INIT-NEXT-ACT-DATE.
000472          10 WS-NEXT-ACT-MOYR       PIC S9(05) COMP-3.
000473          10 WS-NEXT-ACT-DAY        PIC S9(03) COMP-3.

000476      05 WS-DEFERRED-DATE.
000477          10 WS-DEFER-MM            PIC 9(02).
000478          10 WS-DEFER-DD            PIC 9(02).
000479          10 WS-DEFER-YYYY          PIC 9(04).

000480      05 WS-NEW-MAT-DATE.
000481          10 WS-NEW-MAT-MM          PIC 9(02).
000482          10 WS-NEW-MAT-DD          PIC 9(02).
000483          10 WS-NEW-MAT-YYYY        PIC 9(04).

000484      05 WS-EXT-MAT-DATE.
000485          10 WS-EXT-MAT-MM          PIC 9(02).
000486          10 WS-EXT-MAT-DD          PIC 9(02).
000487          10 WS-EXT-MAT-YYYY        PIC 9(04).

000488      05 WS-FORMAT3-DATE.
000489          10 WS-FORMAT3-MM          PIC 9(02).
000490          10 WS-FORMAT3-DD          PIC 9(02).
000491          10 WS-FORMAT3-YYYY        PIC 9(04).

000493      05 WS-TOTAL-NET-AMOUNT        PIC S9(09)V99.
000494      05 WS-PREM-TOTAL              PIC S9(11)V99 COMP-3.
000495      05 WS-NET-AMOUNT              PIC S9(09)V99.
000496      05 WS-BONUS-AMT               PIC S9(9)V99 COMP-3.
000497      05 WS-GROSS-AMT               PIC S9(9)V99 COMP-3.
000498      05 WS-ADDL-1035-AMT           PIC S9(9)V99 COMP-3.
000499      05 WS-ADDL-NRML-AMT           PIC S9(9)V99 COMP-3.
000500      05 WS-ADDL-ROLL-AMT           PIC S9(9)V99 COMP-3.
000501      05 WS-ADDL-TRST-AMT           PIC S9(9)V99 COMP-3.
000502      05 WS-NET-AMT-ED              PIC ZZZZZZZZ9.99.
000503      05 WS-SURR-CHARGES-ED         PIC ZZZZZZ9.99.
000504      05 WS-ASOF-SAVE-DATE          PIC X(04).
000505      05 WS-PRI-OWNER-ID            PIC X(03).

000507      05 WS-ASOF-DATE.
000508          10 WS-ASOF-MM             PIC 9(02).
000509          10 WS-ASOF-DD             PIC 9(02).
000510          10 WS-ASOF-YYYY           PIC 9(04).

000511      05 WS-WORK-DATE.
000512          10 WS-WORK-MM             PIC 9(02).
000513          10 WS-WORK-DD             PIC 9(02).
000514          10 WS-WORK-YYYY           PIC 9(04).

000515      05 WS-WORK-DATE2.
000516          10 WS-WORK2-MM            PIC 9(02).
000517          10 WS-WORK2-DD            PIC 9(02).
000518          10 WS-WORK2-YY            PIC 9(04).

000520      05 WS-QUAL-TYPE               PIC X(01).

000521  * DATE AREA

000523      05 WS-BEGDATE-EXT             PIC X(08).
000524      05 WS-BEGDATE-CF              COMP-3.
000525          10 WS-BEGDATE-DATE        PIC S9(5).
000526          10 WS-BEGDATE-DAY         PIC S9(3).

000528      05 WS-ENDDATE-EXT             PIC X(08).
000529      05 WS-ENDDATE-CF              COMP-3.
000530          10 WS-ENDDATE-DATE        PIC S9(5).
000531          10 WS-ENDDATE-DAY         PIC S9(3).

000533      05 WS-CURR-DATE.
000534          10 WS-CURR-YEAR           PIC 9(02).
000535          10 WS-CURR-MO             PIC 9(02).
000536          10 WS-CURR-DAY            PIC 9(02).

000537      05 WS-CURR-CONV-DATE.
000538          10 WS-CURR-CONV-MM        PIC 9(02).
000539          10 WS-CURR-CONV-DD        PIC 9(02).
000540          10 WS-CURR-CONV-CC        PIC 9(02).
000541          10 WS-CURR-CONV-YY        PIC 9(02).

000542      05 WS-INT-CEASE-DATE          COMP-3.
000543          10 WS-CURR-CEASE-YEAR     PIC S9(03).
000544          10 WS-CURR-CEASE-DAY      PIC S9(03).

000546      05 WS-INT-BEGIN-DATE          COMP-3.
000547          10 WS-INT-BEGIN-YEAR      PIC S9(3) VALUE +0.
000548          10 WS-INT-INTERNAL-DAY    PIC S9(3) VALUE +0.
000549      05 WS-INTER-BDATE             PIC X(04).

000551      05 WS-INT-END-DATE            COMP-3.
000552          10 WS-INT-END-YEAR        PIC S9(3) VALUE +0.
000553          10 WS-INT-END-DAY         PIC S9(3) VALUE +0.
000554      05 WS-INTER-EDATE             PIC X(04).

000556      05 WS-INT-WORK-DATE.
000557          10 WS-INT-WORK-MMYY       PIC S9(3) COMP-3.
000558          10 WS-INT-WORK-DD         PIC S9(3) COMP-3.

000560      05 WS-INT-MATURITY-DATE.
000561          10 WS-INT-MAT-MMYY        PIC S9(3) COMP-3.
000562          10 WS-INT-MAT-DD          PIC S9(3) COMP-3.

000564      05 WS-INT-DEFERRED-DATE.
000565          10 WS-INT-DEF-MMYY        PIC S9(3) COMP-3.
000566          10 WS-INT-DEF-DD          PIC S9(3) COMP-3.
000565 05  WS-INT-DEFERRED-DATE.
000566     10  WS-INT-DEF-MMYY      PIC S9(3) COMP-3.
000567     10  WS-INT-DEF-DD        PIC S9(3) COMP-3.

000568 05  WS-ASOF-EXT-DATE.
000569     10  WS-ASOF-EXT-MM       PIC X(02) VALUE SPACE.
000570     10  WS-ASOF-EXT-DD       PIC X(02) VALUE SPACE.
000571     10  WS-ASOF-EXT-YEAR     PIC X(04) VALUE SPACE.

000572 05  WS-INT30-DATE.
000573     10  WS-INT30-MMYY        PIC S9(3) COMP-3.
000574     10  WS-INT30-DD          PIC S9(3) COMP-3.
000575     10  WS-INT-WORK-DD       PIC S9(3) COMP-3.

000576 05  WS-INT-MATURITY-DATE.
000577     10  WS-INT-MAT-MMYY      PIC S9(3) COMP-3.
000578     10  WS-INT-MAT-DD        PIC S9(3) COMP-3.

000579 05  WS-INT60-DATE.
000580     10  WS-INT60-MMYY        PIC S9(3) COMP-3.
000581     10  WS-INT60-DD          PIC S9(3) COMP-3.

000582 05  WS-INT90-DATE.
000583     10  WS-INT99-MMYY        PIC S9(3) COMP-3.
000584     10  WS-INT90-DD          PIC S9(3) COMP-3.

000585 05  WS-INT-ISSUE-DATE        COMP-3.
000586     10  WS-INT-ISSUE-MMYY    PIC S9(03).
000587     10  WS-INT-ISSUE-DD      PIC S9(03).

000588 05  WS-ISSUE1-DATE           COMP-3.
000589     10  WS-ISSU1-MMYY        PIC S9(03).
000590     10  WS-ISSU1-DD          PIC S9(03).

000591 05  WS-ISSUE2-DATE           COMP-3.
000592     10  WS-ISSU2-MMYY        PIC S9(03).
000593     10  WS-ISSU2-DD          PIC S9(03).
000594 05  WS-TABLE-KEY.
000595     10  WS-TABLE-PLAN        PIC X(10).
000596     10  WS-TABLE-OPTION      PIC X(01).
000597     10  FILLER               PIC X(18) VALUE LOW-VALUES.

000598 05  WS-TRANS-PLAN            PIC X(11).

000599 05  WS-TABLE-OUTPUT.
000600     10  FILLER               PIC X(11).
000601     10  WS-TABLE-PLAN-DESC   PIC X(40).

000602 05  WS-FORMAT-DATE.
000603     10  WS-FORMAT-MM         PIC X(02) VALUE SPACE.
000604     10  WS-FORMAT-DD         PIC X(02) VALUE SPACE.
000605     10  WS-FORMAT-YYYY       PIC X(04) VALUE SPACE.

000606 05  WS-BEGIN-DATE-FORMAT     PIC X(10).
000607 05  WS-END-DATE-FORMAT       PIC X(10).

000608 05  WS-ISSUE-DATE.
000609     10  WS-ISSUE-MM          PIC X(02) VALUE SPACE.
000610     10  WS-ISSUE-DD          PIC X(02) VALUE SPACE.
000611     10  WS-ISSUE-YYYY        PIC X(04) VALUE SPACE.

000612 05  WS-APPL-DATE.
000613     10  WS-APPL-MM           PIC X(02) VALUE SPACE.
000614     10  WS-APPL-DAY          PIC X(02) VALUE SPACE.
000615     10  WS-APPL-YEAR         PIC X(04) VALUE SPACE.

000616 05  WS-DISB-DATE             COMP-3.
000617     10  WS-DISB-YEAR         PIC S9(3).
000618     10  WS-DISB-DAY          PIC S9(3).

000619 05  WS-DEPOS-DATE            COMP-3.
000620     10  WS-DEPOS-YEAR        PIC S9(3).
000621     10  WS-DEPOS-DAY         PIC S9(3).

000622 05  WS-CHECK-DATE            PIC X(08).
000623 05  WS-DEPOS-DATE              COMP-3.
000624     10  WS-DEPOS-YEAR          PIC S9(3).
000625     10  WS-DEPOS-DAY           PIC S9(3).

000626 05  WS-CHECK-DATE              PIC X(08).

000627 05  WS-PD-SUB                  PIC S9(04) COMP-3 VALUE 0.
000628 05  WS-SUB                     PIC S9(3) COMP-3.
000629 05  WS-SUB2                    PIC S9(3) COMP-3.
000630 05  RP-INDEX                   USAGE IS INDEX.
000631 05  WS-POLICY-READ-CNT         PIC 9(09) VALUE ZERO.
000632 05  WS-SUB                   PIC S9(3) COMP-3.
000633 05  WS-SUB2                  PIC S9(3) COMP-3.
000634 05  RP-INDEX                 USAGE IS INDEX.
000635 05  WS-POLICY-READ-CNT       PIC 9(09) VALUE ZERO.
000636 05  WS-POLICY-READ-2         PIC 9(09) VALUE ZERO.
000637 05  TERMINATED-COUNT         PIC 9(09) VALUE ZERO.
000638 05  PASSED-TERMINATED-COUNT  PIC 9(09) VALUE ZERO.
000639 05  ACTIVE-COUNT             PIC 9(09) VALUE ZERO.
000640 05  WS-RP-LINE-COUNT         PIC 9(03) VALUE ZERO.
000641 05  WS-PD-IND                PIC X(1).

000642     88  WS-PD-FOUND          VALUE 'Y'.
000643     88  WS-PD-NOT-FOUND      VALUE 'N'.
000646 05  WS-WORK-COUNTERS.
000647     10  WS-READ-I-CNTR       PIC S9(9) COMP-3.
000648     10  WS-READ-H-CNTR       PIC S9(9) COMP-3.
000649     10  WS-FULLSURR-CNTR     PIC S9(9) COMP-3.
000650     10  WS-TERM-DEAD-CNTR    PIC S9(9) COMP-3.
000651     10  WS-PRTWITH-CNTR      PIC S9(9) COMP-3.
000652     10  WS-INIT-PAY-CNTR     PIC S9(9) COMP-3.
000653     10  WS-ADDTL-PAY-CNTR    PIC S9(9) COMP-3.
000654     10  WS-REG-PAY-CNTR      PIC S9(9) COMP-3.
000655     10  WS-REIN-PAY-CNTR     PIC S9(9) COMP-3.
000656     10  WS-LOAN-PAY-CNTR     PIC S9(9) COMP-3.
000657     10  WS-POL-FOUND-CNTR    PIC S9(9) COMP-3.
000658     10  WS-REC-WRITTEN-CNTR  PIC S9(9) COMP-3.
000659     10  WS-COUNTER-WITH      PIC S9(9) COMP-3.
000660     10  WS-COUNTER-SURR-CHG  PIC S9(9) COMP-3.
000661     10  WS-COUNTER-SURR-CHG    PIC S9(9) COMP-3.
000662
000663     EJECT
000664 *******************************************************
000665 *  INPUT DATE CARD AREA - DATE FORMAT MMDDYYYYMMDDYYYY
000666 *******************************************************
000667 01  WS-CARDIN-AREA.
000668     05  BEGIN-DATE            PIC X(08).
000669     05  END-DATE              PIC X(08).
000670     05  FILLER                PIC X(64).
000671     05  FILLER                PIC X(64).
000672     EJECT

000673 *******************************************************
000674 *        INFORCE RECORD CONTROL SECTION               *
000674 *******************************************************
000675 *        INFORCE RECORD CONTROL SECTION               *
000676 *******************************************************
000677 01  INFORCE-FILE-AREA.
000678     05  INFORCE-REC-LENGTH    PIC S9(4) COMP.
000679     05  INFORCE-FILE-KEY.
000680         10  INFORCE-REC-ID    PIC X(01).
000681         10  INFORCE-USER-ID   PIC X(1).
000682         10  INFORCE-POL-NUMBER PIC X(10).
000683     05  INFORCE-IO-STAT       PIC X(01).
000684     05  FILLER                PIC X(64985).
000685     EJECT

000686 01  INFORCE-FILE-DCB.
000687     COPY CKDCBMAX.
000688     EJECT

000689 01  INFORCE-FILE-AUXDCB       PIC X(25000).
000690 01  HISTORY-FILE-AUXDCB       PIC X(25000).
000692 *******************************************************
000693 *        HISTORY RECORD CONTROL SECTION               *
000694 *******************************************************
000695     COPY CKNRECRC.
000696     05  FILLER                PIC X(13980).
000697     EJECT

000698 01  HISTORY-FILE-DCB.
000699     COPY CKDCBLRG.
000700     COPY CKUBGPRM.
000701     EJECT

000702 *******************************************************
000703 *                    OUTPUT RECORD                     *
000704 *******************************************************
000705 01  OFFLINE-RECORD              PIC X(1000) VALUE SPACE.
000706     EJECT

000707 *******************************************************
000708 *                    REPORT RECORD                     *
000709 *******************************************************
000710 01  RP-RECORD.
000711     05  RP-POLICY               PIC X(08).
000712     05  FILLER                  PIC X(01) VALUE X'05'.
000713     05  RP-POL-STATUS           PIC X(02).
000714     05  FILLER                  PIC X(01) VALUE X'05'.
000715     05  RP-STATUS               PIC X(25).
000716     05  FILLER                  PIC X(01) VALUE X'05'.
000717     05  RP-ISSUE-DATE           PIC X(10).
000718     05  FILLER                  PIC X(01) VALUE X'05'.
000719     05  RP-PRODUCT-NAME         PIC X(51).
000720     05  FILLER                  PIC X(01) VALUE X'05'.
000721     05  RP-AGNT-ID              PIC X(10).
000722     05  FILLER                  PIC X(01) VALUE X'05'.
000723     05  RP-AGENT-PER            PIC ZZZZZZZ9.99.
000724     05  FILLER                  PIC X(01) VALUE X'05'.
000725     05  RP-PERSISTENCY-IND      PIC X(02).
000726     05  FILLER                  PIC X(01) VALUE X'05'.
000727     05  RP-PERSIST-DATE         PIC X(10).
000728     05  FILLER                  PIC X(01) VALUE X'05'.
000729     05  RP-QUAL-CODE            PIC X(20).
000730     05  FILLER                  PIC X(01) VALUE X'05'.
000731     05  RP-CASH-VALUE           PIC -------9.99.
000732     05  FILLER                  PIC X(01) VALUE X'05'.
000733     05  RP-INSURED-NAME         PIC X(81).
000734     05  FILLER                  PIC X(01) VALUE X'05'.
000735     05  TAB1 OCCURS 5 TIMES.
000736         10  RP-OWNER-NAME       PIC X(81).
000737         10  FILLER              PIC X(01) VALUE X'05'.
000738     EJECT
000739 01  TRANS-STORE-GROSS          PIC S9(9)V99 COMP-3.
000740 01  TRANS-STORE-WS-AMT         PIC S9(9)V99 COMP-3.
000741 01  TRANS-STORE-WH-AMT         PIC S9(9)V99 COMP-3.

000742 *******************************************************
000743 *                   SEGMENT AREA PLUS                 *
000744 *******************************************************
000745     COPY CKFRECCV.
000746     EJECT
000747     COPY CKFRECSB.
000748     EJECT
000749     COPY CKFRECAU.
000750     EJECT
000751     COPY CKFRECIF.
000752     EJECT
000753     COPY CKAPIFLG.
000754     EJECT
000755     COPY CKFRECUM.
000756     EJECT

000757 N16623 01  ALLOCATION-SECTION-SEGMENT.
000758 N16623     COPY CKFRECAL.
000759     EJECT

000760 N16623 01  ALLOCATION-FLAG-BYTES.
000761 N16623     COPY CKFLGFAL.
000762     EJECT

000763     COPY CKFRECRC.
000764     03  FILLER                 PIC X(64980).
000765     EJECT
000766     COPY CKULGPRM.
000767     EJECT
000768     COPY CKULAFLG REPLACING ACTIVITY-FLAGS BY
000769                           ACTIVITY-SEG-FLAG-BYTES.
000770     EJECT

000771 01  USER-SEGMENT.
000772     COPY CKFRECUZ.
000773     EJECT

000774 01  REPLACEMENT-SEGMENT.
000775     COPY CKFRECTR.
000776     EJECT
000777 01  INQUIRY-LIFE-CNTL-SEGMENT.
000778     COPY CKFRECLC.
000779     EJECT

000780 01  NEW-BUSINESS-SEGMENT.
000781     COPY CKFRECNB.
000782     EJECT
000783     COPY CKFRECUR.
000784     EJECT
000785     COPY CKFRECNA.
000786     EJECT
000787     COPY CKFRECBC.
000788     EJECT

000789 01  AP-CONTROL-FLAG-BYTES.
000790     COPY CKFULFLG.
000791     EJECT
000792     COPY CKFRECUL.
000793     EJECT
000794     COPY CKFRECUY.
000795     EJECT
000796     COPY CKFRECUA.
000797     EJECT
000798     COPY CKFRECBR.
000799     EJECT
000800     COPY CKFRECNO.
000801     EJECT
000802     COPY CKFRECUV.
000803     EJECT

000805 01  AGENT-SEGMENT.
000806     COPY CKFRECAG.
000807     EJECT

000808 01  AGENTS-BASIC-SECTION.
000809     COPY CKGRECBS.
000810     EJECT

000811 01  AGENT-NAME-SEGMENT.
000812     COPY CKGRECNM.
000813     EJECT

000814 01  AGENT-COMMUN-SEGMENT.
000815     COPY CKGRECCO.
000816     EJECT

000817 01  AGENTS-EH-SECTION.
000818     COPY CKGRECEH.
000819     EJECT

000820 01  AGENT-CONTRACT-INFO-SEGMENT.
000821     COPY CKGRECCI.
000822     EJECT
000824 01  WS-ACF-AREA.
000825     05  WS-ACF-BASIC-SECTION.
000826         10  WS-ACF-LNGTH        PIC S9(04) COMP.
000827         10  WS-ACF-RECID        PIC X(01).
000828         10  WS-ACF-CNTRL.
000829             15  WS-USER         PIC X(01).
000830             15  WS-ACF-AGT-NUMBER PIC X(10).
000831         10  WS-ACF-REST-OF-BASIC PIC X(75).
000832     05  WS-ACF-REST             PIC X(13911).

000834 01  WS-ACF-DCB                  PIC X(25000).

000836 01  AGENT-CONTRACT-INFO-SEGMENT.
000837     COPY CKGRECCI.
000838     EJECT

000839 * AUXSEG1 RECORD AREA
000840     COPY CKAUXDCB REPLACING AUXBLOCK-AUXILIARY-DCB
000841                         BY AUX-INF-DCB.
000842     EJECT

000843     COPY CKESDTB1 REPLACING SEGMENT-DEFINITION-TABLE BY
000844                         INFORCE-AUX-SDT.
000845     EJECT

000846 * AUXSEGH RECORD AREA
000847     COPY CKAUXDCB REPLACING AUXBLOCK-AUXILIARY-DCB
000848                         BY AUX-HIST-DCB.
000849     EJECT

000850     COPY CKESDTB1 REPLACING SEGMENT-DEFINITION-TABLE BY
000851                         HISTORY-AUX-SDT.
000852     EJECT
000852     HISTORY-AUX-SDT.
000853     EJECT
000854 ************************************************************
000855 *                 BATCH I/O RECORD                         *
000856 ************************************************************
000857     COPY CKBCHCDS REPLACING
000858          BCHCODES-CALLING-CODES BY BCHCODES.
000859 01  FILLER                    PIC X(32)
000860     VALUE 'NYF22766 WORKING STORAGE ENDS'.
000861     EJECT
000862 LINKAGE SECTION.
000863     EJECT
000864 PROCEDURE DIVISION.
000865 ************************************************************
000866 *                     MAINLINE LOGIC                       *
000867 ************************************************************
000868 0000-CONTROL-PROCESS.
000869     PERFORM 1000-INITIALIZATION
000870         THRU 1099-INITIALIZATION-EXIT.

000872     PERFORM 1100-OPEN-FILES
000873         THRU 1199-OPEN-FILES-EXIT.

000875     SET CONTINUE-PROCESSING TO TRUE.
000876     MOVE SPACE TO END-OF-FILE-INDICATOR.

000878     MOVE 'N' TO END-OF-TABLE-INDICATOR.
000879     PERFORM 2000-MAIN-PROCESS
000880         THRU 2000-MAIN-PROCESS-EXIT
000881         UNTIL END-OF-FILE.

000883     PERFORM EOJ9000-CLOSE-FILES
000884         THRU EOJ9999-EXIT.

000886     GOBACK.
000887     EJECT
000888 ************************************************************
000889 *                       INITIALIZATION                     *
000890 ************************************************************
000891 1000-INITIALIZATION.
000890 ************************************************************
000891 1000-INITIALIZATION.

000892     CALL 'CKSETADR' USING BINARY1
000893          UBAUXHCB-AUX-HIST-DCB-ADDR
000894          AUX-HIST-DCB.

000896     MOVE LOW-VALUES TO AUX-HIST-DCB.

000898     CALL 'CKSETADR' USING BINARY1
000899          AUXSEGDT-PTR OF AUX-HIST-DCB
000900          HISTORY-AUX-SDT.

000902     MOVE ZERO TO WS-IO-CODE.
000903     MOVE ZERO TO WS-PD-SUB.
000904     MOVE LOW-VALUES TO INFORCE-FILE-DCB.
000905     INITIALIZE INFORCE-FILE-AREA.

000907     CALL 'CKCOBCRD' USING WS-CARDIN-AREA
000908                          WS-IO-CODE.

000910     MOVE 'N' TO END-OF-TABLE-INDICATOR.

000912     INITIALIZE WS-WORK-COUNTERS.

000914 * GET CURRENT DATE
000915     ACCEPT WS-CURR-DATE FROM DATE.
000916     MOVE WS-CURR-MO  TO WS-CURR-CONV-MM.
000917     MOVE WS-CURR-DAY TO WS-CURR-CONV-DD.
000918     MOVE 20          TO WS-CURR-CONV-CC.
000919     MOVE WS-CURR-YEAR TO WS-CURR-CONV-YY.
000920 CBR1* CALL 'CKDCEXIN' USING WS-CURR-CONV-DATE
000921 CBR1*                    WS-INT-CURR-DATE.

000923 1099-INITIALIZATION-EXIT.
000924     EXIT.
000928 *T  OPEN ALL FILES
000929 ************************************************************
000930 1100-OPEN-FILES.

000932 * OPEN PVE EXTRACT FILE
000933     OPEN INPUT PVERESP-EXTRACT-FILE.

000935 * OPEN OUTPUT SEQUENTIAL FILES
000936     MOVE BCHTAPE1-TAPE1 TO BCHCODES-CALLING-FILE.
000937     MOVE BCHOPEN-OPEN-OUTPUT TO BCHCODES-CALLING-RETURN.

000938     PERFORM SUB4000-IOROUTINE
000939         THRU SUB4999-IO-ROUTINE-EXIT.

000942 * OPEN AGENT CONTROL FILE
000943     MOVE '6' TO WS-ACF-IO-BYTE.
000944     CALL 'CKVSAMIO' USING ACF-FILE-NAME
000945                          WS-ACF-IO-BYTE.

000947     IF WS-ACF-IO-BYTE IS NOT EQUAL TO ZERO
000948         DISPLAY 'AGENT CONTROL FILE OPEN ERROR'
000949         GO TO EOJ9900-ABEND
000950     END-IF.

000952     SET CONTINUE-PROCESSING TO TRUE.
000953     MOVE '6' TO WS-IO-CODE.
000954     CALL 'CKVSAMIO' USING INFORCE-VSAM
000955                          WS-IO-CODE
000956                          INFORCE-FILE-AREA
000957                          INFORCE-FILE-LENGTH
000958                          INF-RECORD-KEY
000959                          INFORCE-VSAMX-INFO.

000961     IF WS-IO-CODE NOT EQUAL '0'
000962         DISPLAY 'OPEN INFORCE FAILED'
000963         DISPLAY 'WS-IO-CODE=' WS-IO-CODE
000964         GO TO EOJ9900-ABEND.
000968     CALL 'CKSDTIO' USING WS-IO-CODE
000969                          INFORCE-AUX-SDT.

000971     IF WS-IO-CODE NOT EQUAL '0'
000972         DISPLAY 'OPEN OF AUXSEG1 FILE FAILED'
000973         DISPLAY 'WS-IO-CODE=' WS-IO-CODE
000974         GO TO EOJ9900-ABEND.

000976     MOVE '6' TO WS-IO-CODE.
000977     CALL 'CKSDTXIO' USING WS-IO-CODE
000978                          HISTORY-AUX-SDT
000979                          SDT-H-TABLE-NAME.

000981     IF WS-IO-CODE NOT EQUAL '0'
000982         DISPLAY 'OPEN OF AUXSEGH FILE FAILED'
000983         DISPLAY 'WS-IO-CODE=' WS-IO-CODE
000984         GO TO EOJ9900-ABEND.

000986     MOVE '4' TO WS-IO-CODE.
000987     CALL 'CKETRLST' USING WS-IO-CODE
000988                          WS-DUMMY
000989                          INFORCE-FILE-DCB
000990                          WS-DUMMY
000991                          WS-DUMMY
000992                          WS-DUMMY
000993                          AUX-INF-DCB.

000995     MOVE '4' TO WS-IO-CODE.
000996     CALL 'CKETRLST' USING WS-IO-CODE
000997                          WS-DUMMY
000998                          HISTORY-FILE-DCB
000999                          WS-DUMMY
001000                          WS-DUMMY
001001                          WS-DUMMY
001002                          AUX-HIST-DCB
001003                          HISTORY-AUX-SDT.

001005 * OPEN HISTORY AND AUXSEGH FILES
001006     MOVE HISTORY-VSAMX-INFO TO UBHIST-HISTORY-VSAMX.
001007     MOVE '6' TO WS-IO-CODE.
001008     CALL 'CKVSAMIO' USING HISTORY-VSAM
001005 * OPEN HISTORY AND AUXSEGH FILES
001006     MOVE HISTORY-VSAMX-INFO TO UBHIST-HISTORY-VSAMX.
001007     MOVE '6' TO WS-IO-CODE.
001008     CALL 'CKVSAMIO' USING HISTORY-VSAM
001009                          WS-IO-CODE
001010                          HISTORY-RECORD
001011                          HISTORY-FILE-LENGTH
001012                          NRCSRCH-SEARCH-KEY
001013                          UBHIST-HISTORY-VSAMX.

001015     IF WS-IO-CODE NOT EQUAL '0'
001016         DISPLAY 'OPEN HISTORY FAILED'
001017         DISPLAY 'WS-IO-CODE=' WS-IO-CODE
001018         GO TO EOJ9900-ABEND.

001020     MOVE '6' TO WS-IO-CODE.
001021     CALL 'CKSDTXIO' USING WS-IO-CODE
001022                          HISTORY-AUX-SDT
001023                          SDT-H-TABLE-NAME.

001025     IF WS-IO-CODE NOT EQUAL '0'
001026         DISPLAY 'OPEN OF AUXSEGH FILE FAILED'
001027         DISPLAY 'WS-IO-CODE=' WS-IO-CODE
001028         GO TO EOJ9900-ABEND.

001030     MOVE '4' TO WS-IO-CODE.
001031     CALL 'CKETRLST' USING WS-IO-CODE
001032                          WS-DUMMY
001033                          HISTORY-FILE-DCB
001034                          WS-DUMMY
001035                          WS-DUMMY
001036                          WS-DUMMY
001037                          AUX-HIST-DCB
001038                          HISTORY-AUX-SDT.

001040 1199-OPEN-FILES-EXIT.
001041     EXIT.
001043     EJECT
001044 ************************************************************
001045 *                     MAIN PROCESS                         *
001046 ************************************************************
001047 2000-MAIN-PROCESS.

001048     PERFORM 2100-READ-INFORCE
001049         THRU 2199-READ-INFORCE-EXIT.

001051     IF END-OF-FILE
001052         GO TO 2000-MAIN-PROCESS-EXIT
001053     END-IF.

001055 * PROCESS VA POLICIES ONLY
001056     IF ((FRCCNTRT-CONTRACT-NUMBER(1:1) = '6' OR '7') OR
001057         (FRCCNTRT-CONTRACT-NUMBER(1:2) = '56'))
001058         GO TO 2000-MAIN-PROCESS
001059     ELSE
001060         GO TO CONTINUE-RTN
001061     END-IF.

001063 CONTINUE-RTN.

001065     INITIALIZE RP-RECORD
001066                WS-AGENT-CHK.

001068     MOVE FRCCNTRT-CONTRACT-NUMBER TO RP-POLICY.

001070     SET INFORCE-FILE TO TRUE.

001072     PERFORM P100-PROCESS-SEG-01
001073         THRU P100-PROCESS-SEG-01-EXIT.

001076     IF NOT AGENT-PRESENT
001077         PERFORM P300-PROCESS-SEG-48
001078             THRU P300-PROCESS-SEG-48-EXIT
001079     END-IF.
001081     IF NOT AGENT-PRESENT
001082         GO TO SKIP-PROCESSING
001083     END-IF.

001085     PERFORM P200-PROCESS-SEG-02
001086         THRU P200-PROCESS-SEG-02-EXIT.

001088     PERFORM P200-PROCESS-SEG-52
001089         THRU P200-PROCESS-SEG-52-EXIT.

001090     PERFORM P400-PROCESS-SEG-89
001091         THRU P400-PROCESS-SEG-89-EXIT.

001093     PERFORM 3500-PROCESS-PVEFILE
001094         THRU 3599-PROCESS-PVEFILE-EXIT.

001096 *** WRITE REPORT
001097 CBR1 MOVE SPACE      TO OFFLINE-RECORD
001098 CBR1 MOVE RP-RECORD  TO OFFLINE-RECORD
001099 CBR1 MOVE BCHWRITN-WRITE-NEW
001100 CBR1     TO BCHCODES-CALLING-RETURN
001101 CBR1 MOVE BCHTAPE1-TAPE1
001102 CBR1     TO BCHCODES-CALLING-FILE
001103 CBR1 PERFORM SUB4000-IOROUTINE
001104 CBR1     THRU SUB4999-IO-ROUTINE-EXIT.

001107 SKIP-PROCESSING.

001108     MOVE '4' TO WS-IO-CODE.
001109     CALL 'CKETRLST' USING WS-IO-CODE
001110                          WS-DUMMY
001111                          INFORCE-FILE-DCB
001112                          WS-DUMMY
001113                          WS-DUMMY
001114                          WS-DUMMY
001115                          AUX-INF-DCB.

001118     MOVE '4' TO WS-IO-CODE.
001119     CALL 'CKETRLST' USING WS-IO-CODE
001120                          WS-DUMMY
001121                          HISTORY-FILE-DCB
001122                           WS-DUMMY
001123                           WS-DUMMY
001124                           AUX-HIST-DCB
001125                           HISTORY-AUX-SDT.

001127 2000-MAIN-PROCESS-EXIT.
001128     EXIT.
001129     EJECT
001131 *******************************************************
001132 * THIS ROUTINE WILL READ THE INFORCE FILE AND DO A     *
001133 * TRAILER LIST ON THE RECORD.                           *
001134 *******************************************************
001135 2100-READ-INFORCE.

001137     MOVE '4' TO WS-IO-CODE.
001138     CALL 'CKETRLST' USING WS-IO-CODE
001139                           WS-DUMMY
001140                           INFORCE-FILE-DCB
001141                           WS-DUMMY
001142                           WS-DUMMY
001143                           WS-DUMMY
001144                           AUX-INF-DCB.

001146     MOVE '4' TO WS-IO-CODE.
001147     CALL 'CKETRLST' USING WS-IO-CODE
001148                           WS-DUMMY
001149                           HISTORY-FILE-DCB
001150                           WS-DUMMY
001151                           WS-DUMMY
001152                           WS-DUMMY
001153                           AUX-HIST-DCB
001154                           HISTORY-AUX-SDT.

001157     MOVE '2' TO WS-IO-CODE.
001158     CALL 'CKVSAMIO' USING INFORCE-VSAM
001159                           WS-IO-CODE.
001160                           INQUIRY-RECORD-CONTROL-SECTION
001161                           INFORCE-FILE-LENGTH
001162                           INF-RECORD-KEY
001163                           INFORCE-VSAMX-INFO.

001165     IF WS-IO-CODE = '6' OR
001166        FRCCNTRT-CONTRACT-NUMBER EQUAL HIGH-VALUES
001167         SET END-OF-FILE TO TRUE
001168         SET END-OF-PROCESSING TO TRUE
001169         GO TO 2199-READ-INFORCE-EXIT.
001170     END-IF.

001171     IF FRCCNTRT-CONTRACT-NUMBER EQUAL 'A'
001172         GO TO 2100-READ-INFORCE.

001174     IF WS-IO-CODE NOT EQUAL '0'
001175         DISPLAY 'INFORCE READ ERROR'
001176         DISPLAY 'WS-IO-CODE=' WS-IO-CODE
001177         GO TO EOJ9900-ABEND.
001178     END-IF.

001180     MOVE '4' TO WS-IO-CODE.
001181     CALL 'CKETRLST' USING WS-IO-CODE
001182                           WS-DUMMY
001183                           INFORCE-FILE-DCB
001184                           WS-DUMMY
001185                           WS-DUMMY
001186                           WS-DUMMY
001187                           AUX-INF-DCB.

001189     MOVE '4' TO WS-IO-CODE.
001190     CALL 'CKETRLST' USING WS-IO-CODE
001191                           WS-DUMMY
001192                           HISTORY-FILE-DCB
001193                           WS-DUMMY
001194                           WS-DUMMY
001195                           WS-DUMMY
001196                           AUX-HIST-DCB
001197                           HISTORY-AUX-SDT.
001199     MOVE '0' TO WS-IO-CODE.
001200     MOVE 'C' TO AUXEFLG1 OF AUX-INF-DCB.
001201     MOVE 'S' TO AUXEFLG2 OF AUX-INF-DCB.
001202     MOVE 'I' TO AUXEFLG3 OF AUX-INF-DCB.
001203     MOVE 'F' TO AUXEFLG4 OF AUX-INF-DCB.
001204     MOVE 'V' TO AUXEFLG6 OF AUX-INF-DCB.
001205     MOVE AUX-INF-DCB TO INFORCE-FILE-AUXDCB.

001207     MOVE LENGTH OF INQUIRY-RECORD-CONTROL-SECTION
001208          TO INFORCE-BASIC-LENGTH.

001210     CALL 'CKETRLST' USING WS-IO-CODE
001211                           INQUIRY-RECORD-CONTROL-SECTION
001212                           INFORCE-FILE-DCB
001213                           INFORCE-BASIC-LENGTH
001214                           INFORCE-PRMAX
001215                           INFORCE-MAX-SEGS
001216                           INFORCE-FILE-AUXDCB
001217                           INFORCE-AUX-SDT.

001219     IF WS-IO-CODE NOT EQUAL '0'
001220         DISPLAY 'ERROR IN SDT BUILD AUX1, RC = ' WS-IO-CODE
001221         ' POLICY NUMBER = ' FRCCNTRT-CONTRACT-NUMBER
001222         GO TO EOJ9900-ABEND
001223     END-IF.

001225     MOVE '0' TO WS-IO-CODE.
001226     MOVE 'C' TO AUXEFLG1 OF AUX-HIST-DCB.
001227     MOVE 'S' TO AUXEFLG2 OF AUX-HIST-DCB.
001228     MOVE 'I' TO AUXEFLG3 OF AUX-HIST-DCB.
001229     MOVE 'F' TO AUXEFLG4 OF AUX-HIST-DCB.
001230     MOVE 'V' TO AUXEFLG6 OF AUX-HIST-DCB.

001232     MOVE AUX-HIST-DCB TO HISTORY-FILE-AUXDCB.
001233     CALL 'CKETRLST' USING WS-IO-CODE
001234                           HISTORY-RECORD
001235                           HISTORY-FILE-DCB
001236                           INFORCE-BASIC-LENGTH
001237                           INFORCE-PRMAX
001238                           INFORCE-MAX-SEGS
001239                           HISTORY-FILE-AUXDCB
001240                           HISTORY-AUX-SDT.

001242     IF WS-IO-CODE NOT EQUAL '0'
001243         DISPLAY 'ERROR IN SDT BUILD AUXH, RC = ' WS-IO-CODE
001244         ' POLICY NUMBER = ' FRCCNTRT-CONTRACT-NUMBER
001245         GO TO EOJ9900-ABEND
001246     END-IF.

001248 2199-READ-INFORCE-EXIT.
001249     EXIT.
001250     EJECT

001252 *******************************************************
001253 *                    END OF JOB                        *
001254 *******************************************************
001255 EOJ9900-ABEND.
001256     CALL 'CKABEND'.
001257     EJECT

001259 *******************************************************
001260 *                    CLOSE FILES                       *
001261 *******************************************************
001262 EOJ9000-CLOSE-FILES.

001264 * CLOSE PVE EXTRACT FILE
001265     CLOSE PVERESP-EXTRACT-FILE.

001267 * CLOSE AGENT CONTROL FILE
001268     MOVE 5 TO WS-IO-CODE
001269     CALL 'CKVSAMIO' USING ACF-FILE-NAME
001270                           WS-IO-CODE.

001272     IF WS-IO-CODE NOT EQUAL '0'
001273         DISPLAY 'CLOSE AGENT FILE FAILED'
001274         DISPLAY 'WS-IO-CODE=' WS-IO-CODE
001275     END-IF.

001275 * CLOSE OUTPUT SEQUENTIAL FILE
001276     MOVE BCHTAPE1-TAPE1 TO BCHCODES-CALLING-FILE.
001277     MOVE BCHCLOSE-CLOSE TO BCHCODES-CALLING-RETURN.
001278     PERFORM SUB4000-IOROUTINE
001279         THRU SUB4999-IO-ROUTINE-EXIT.

001281 DEBUG     GO TO EOJ9999-EXIT.

001283 * CLOSE INFORCE FILE
001284     MOVE '5' TO WS-IO-CODE.
001285     CALL 'CKVSAMIO' USING INFORCE-VSAM
001286                           WS-IO-CODE.

001288     IF WS-IO-CODE NOT EQUAL '0'
001289         DISPLAY 'CLOSE INFORCE FAILED'
001290         DISPLAY 'WS-IO-CODE=' WS-IO-CODE
001291     END-IF.

001293 * CLOSE HISTORY FILE
001294     MOVE '5' TO WS-IO-CODE.
001295     CALL 'CKVSAMIO' USING HISTORY-VSAM
001296                           WS-IO-CODE
001297                           WS-DUMMY
001298                           WS-DUMMY
001299                           WS-DUMMY
001300                           UBHIST-HISTORY-VSAMX.

001302     IF WS-IO-CODE NOT EQUAL '0'
001303         DISPLAY 'CLOSE HISTORY FAILED'
001304         DISPLAY 'WS-IO-CODE=' WS-IO-CODE
001305     END-IF.

001307     MOVE '5' TO WS-IO-CODE.
001308     CALL 'CKSDT110' USING WS-IO-CODE
001309                           INFORCE-AUX-SDT.

001311     MOVE '5' TO WS-IO-CODE.
001312     CALL 'CKSDTXIO' USING WS-IO-CODE
001313                           HISTORY-AUX-SDT
001314                           SDT-H-TABLE-NAME.

001316     DISPLAY ' !! PROGRAM COMPLETED SUCCESSFULLY !!'.
001317     DISPLAY ' '.

001319 EOJ9999-EXIT.
001320     EXIT.
001321     EJECT
001323 *******************************************************
001324 *         PROCESS POLICY BASIC SEGMENT                *
001325 *******************************************************
001326 P100-PROCESS-SEG-01.
001327     MOVE +0  TO WS-SEG-SEQ.
001328     MOVE '01' TO WS-SEG-ID.

001330     PERFORM SUB7000-GET-TRLR THRU SUB7999-GET-TRLR-EXIT.

001332     IF WS-IO-CODE IS NOT EQUAL TO '0'
001333         GO TO P100-PROCESS-SEG-01-EXIT
001334     END-IF.

001336     MOVE WS-SEG-WORK-AREA TO INQUIRY-BASIC-SECTION.

001338     IF FBRSTAT-STATUS NOT EQUAL '21' AND '22'
001339         GO TO 2000-MAIN-PROCESS
001340     END-IF.

001342     MOVE FBRSTAT-STATUS TO RP-POL-STATUS.

001344     IF FBRSTAT1-BYTE1 NOT EQUAL '9'
001345         EVALUATE TRUE
001346             WHEN FBRSTAT-STATUS EQUAL '12'
001347                 MOVE 'NEW BUSINESS NOT PAID' TO RP-STATUS
001348             WHEN FBRSTAT-STATUS EQUAL '21'
001349                 MOVE 'ACTIVE--PREMIUM PAY' TO RP-STATUS
001350             WHEN FBRSTAT-STATUS EQUAL '22'
001351                 MOVE 'ACTIVE--PREMIUM PAY' TO RP-STATUS
001352             WHEN FBRSTAT-STATUS EQUAL '32'
001353                 MOVE 'DISABILITY OR COI' TO RP-STATUS
001354             WHEN FBRSTAT-STATUS EQUAL '33'
001355                 MOVE 'DISABILITY WAIVER' TO RP-STATUS
001356             WHEN FBRSTAT-STATUS EQUAL '38'
001357                 MOVE 'DEATH CLAIM PEND' TO RP-STATUS
001358             WHEN FBRSTAT-STATUS EQUAL '95'
001359                 MOVE 'RESCINDED' TO RP-STATUS
001360             WHEN FBRSTAT-STATUS EQUAL '97'
001361                 MOVE 'REINSTATEMENT PENDING' TO RP-STATUS
001362             WHEN FBRSTAT-STATUS EQUAL '98' OR '99'
001363                 MOVE 'TERMINATED' TO RP-STATUS
001364             WHEN OTHER
001365                 MOVE ' ' TO RP-STATUS
001366         END-EVALUATE
001367     END-IF.

001369     IF FBRSTAT1-BYTE1 EQUAL '9'
001370         EVALUATE TRUE
001371             WHEN FBRLSTEN-LAST EQUAL 'L'
001372                 MOVE 'DECEASED' TO RP-STATUS
001373             WHEN FBRLSTEN-LAST EQUAL 'Q'
001374                 MOVE 'LAPSED' TO RP-STATUS
001375             WHEN FBRLSTEN-LAST EQUAL 'M'
001376                 MOVE 'MATURED' TO RP-STATUS
001377             WHEN FBRLSTEN-LAST EQUAL 'X'
001378                 MOVE 'FREE LOOK' TO RP-STATUS
001379             WHEN OTHER
001380                 MOVE 'SURRENDERED' TO RP-STATUS
001381         END-EVALUATE
001382     END-IF.
001382     END-IF.

001384     MOVE FBRAGENT-AGENT TO WS-AGENT-CHK.

001386     IF AGENT-PRESENT
001387         MOVE FBRAGENT-AGENT TO RP-AGNT-ID
001388         COMPUTE WS-AGENT-COMM =
001389                 FAGPCTSH-PERCENT-SHARE-COMM * 100
001390         MOVE WS-AGENT-COMM TO RP-AGENT-PER
001391     END-IF.

001393 P100-PROCESS-SEG-01-EXIT.
001394     EXIT.
001395     EJECT
001396 *******************************************************
001397 *      PROCESS POLICY COVERAGE (02) SEGMENT           *
001398 *******************************************************
001399 P200-PROCESS-SEG-02.
001400     MOVE +0  TO WS-SEG-SEQ.
001401     MOVE '02' TO WS-SEG-ID.

001403 P200-NEXT-SEG-02.

001405     PERFORM SUB7000-GET-TRLR THRU SUB7999-GET-TRLR-EXIT.

001407     IF WS-IO-CODE NOT EQUAL '0'
001408         GO TO P200-PROCESS-SEG-02-EXIT
001409     END-IF.

001411     MOVE WS-SEG-WORK-AREA TO INQUIRY-COVERAGE-SEGMENT.

001413     IF NOT FCVPHASE-BASIC-COV-PHASE
001414         GO TO P200-NEXT-SEG-02
001415     END-IF.

001417     EVALUATE FCVBASE-BASE
001418         WHEN 'LAA'
001419             MOVE 'NYL ACCESS VA'
001420                 TO RP-PRODUCT-NAME
001421         WHEN 'LDA'
001422             MOVE 'NYL COMPLETE ACCESS VA'
001423                 TO RP-PRODUCT-NAME
001424         WHEN 'LD2'
001425             MOVE 'NYL COMPLETE ACCESS VA II'
001426                 TO RP-PRODUCT-NAME
001427         WHEN 'LRA'
001428             MOVE 'NYL ELITE VA'
001429                 TO RP-PRODUCT-NAME
001430         WHEN 'LCA'
001431             MOVE 'NYL ESSENTIALS VA'
001432                 TO RP-PRODUCT-NAME
001433         WHEN 'NVA'
001434         WHEN 'NWA'
001435             MOVE 'NYL FLEXIBLE PREMIUM VA'
001436                 TO RP-PRODUCT-NAME
001437         WHEN 'LIA'
001438         WHEN 'LJA'
001439             MOVE 'NYL FLEXIBLE PREMIUM VA II'
001440                 TO RP-PRODUCT-NAME
001441         WHEN 'LI2'
001442         WHEN 'LJ2'
001443             MOVE 'NYL FLEXIBLE PREMIUM VA III'
001444                 TO RP-PRODUCT-NAME
001445         WHEN 'LKA'
001446             MOVE 'NYL INCOME PLUS VA'
001447                 TO RP-PRODUCT-NAME
001448         WHEN 'LK2'
001449             MOVE 'NYL INCOME PLUS VA II'
001450                 TO RP-PRODUCT-NAME
001451         WHEN 'LGA'
001452             MOVE 'NYL LONGEVITY BENEFIT VA'
001453                 TO RP-PRODUCT-NAME
001454         WHEN 'LTA'
001455         WHEN 'LYA'
001456             MOVE 'NYL PREMIER PLUS VA'
001457                 TO RP-PRODUCT-NAME
001458         WHEN 'LT2'
001459         WHEN 'LY2'
001460             MOVE 'NYL PREMIER PLUS VA II'
001461                 TO RP-PRODUCT-NAME
001462         WHEN 'LUA'
001463         WHEN 'LFA'
001464             MOVE 'NYL PREMIER VA'
001465                 TO RP-PRODUCT-NAME
001466         WHEN 'LU2'
001467         WHEN 'LF2'
001468             MOVE 'NYL PREMIER VA II'
001469                 TO RP-PRODUCT-NAME
001470         WHEN 'LEA'
001471             MOVE 'NYL PREMIUM PLUS ELITE VA'
001472                 TO RP-PRODUCT-NAME
001473         WHEN 'LBA'
001474         WHEN 'LPA'
001475             MOVE 'NYL PREMIUM PLUS VA'
001476                 TO RP-PRODUCT-NAME
001461     WHEN 'LLA'
001462         MOVE 'NYL SELECT VA' TO RP-PRODUCT-NAME
001463     WHEN 'LSA'
001464         MOVE 'NYL VA' TO RP-PRODUCT-NAME
001465     WHEN 'ASU'
001466     WHEN 'BSU'
001467     WHEN 'CSU'
001468         MOVE 'PINNACLE SURVIVORSHIP UL' TO RP-PRODUCT-NAME
001469     WHEN 'AUL'
001470     WHEN 'BUL'
001471     WHEN 'CUL'
001472         MOVE 'PINNACLE UL' TO RP-PRODUCT-NAME
001473     WHEN 'ASV'
001474     WHEN 'BSV'
001475     WHEN 'CSV'
001476         MOVE 'PINNACLE SURVIVORSHIP VUL' TO RP-PRODUCT-NAME
001477     WHEN 'AVU'
001478     WHEN 'BVU'
001479     WHEN 'CVU'
001480         MOVE 'PINNACLE VUL' TO RP-PRODUCT-NAME
001481     WHEN 'SP8'
001482         MOVE 'NYL LEGACY CREATOR SPVUL' TO RP-PRODUCT-NAME
001483     WHEN 'VLW'
001484         MOVE 'NYL LIFETIME WEALTH VUL' TO RP-PRODUCT-NAME
001485     WHEN 'S8A'
001486         MOVE 'NYL SURVIVORSHIP VUL ACCUMULATOR'
001487              TO RP-PRODUCT-NAME
001488     WHEN 'V8A'
001489         MOVE 'NYL VUL ACCUMULATOR'
001490              TO RP-PRODUCT-NAME
001491     WHEN 'V18'
001492         MOVE 'NYL VUL ACCUMULATOR II'
001493              TO RP-PRODUCT-NAME
001494     WHEN 'V8P'
001495         MOVE 'NYL VUL ACCUMULATOR PLUS'
001496              TO RP-PRODUCT-NAME
001497     WHEN 'SPV'
001498         MOVE 'NYL SINGLE PREMIUM VUL'
001499              TO RP-PRODUCT-NAME
001500     WHEN 'SVE'
001501     WHEN 'SVL'
001502         MOVE 'NYL SURVIVORSHIP VUL'
001503              TO RP-PRODUCT-NAME
001504     WHEN 'VUL'
001505         MOVE 'NYL VUL'
001506              TO RP-PRODUCT-NAME
001507     WHEN 'V2E'
001508     WHEN 'V2K'
001509         MOVE 'NYL VUL 2000'
001510              TO RP-PRODUCT-NAME
001511     WHEN 'VDC'
001512         MOVE 'NYL VUL PROVIDER'
001513              TO RP-PRODUCT-NAME
001514     WHEN OTHER
001515         MOVE FCVBASE-BASE TO RP-PRODUCT-NAME
001516 END-EVALUATE.

001518 EVALUATE TRUE
001519     WHEN FCVFQTYP-NONQUALIFIED
001520         MOVE 'NONQUALIFIED' TO RP-QUAL-CODE
001521     WHEN FCVFQTYP-IRA
001522         MOVE 'IRA' TO RP-QUAL-CODE
001523     WHEN FCVFQTYP-KEOGH
001524         MOVE 'KEOGH' TO RP-QUAL-CODE
001525     WHEN FCVFQTYP-HR10
001526         MOVE 'H.R 10' TO RP-QUAL-CODE
001527     WHEN FCVFQTYP-SHELTER
001528         MOVE 'TSA' TO RP-QUAL-CODE
001529     WHEN FCVFQTYP-PENSION
001530         MOVE 'CORPPENSION' TO RP-QUAL-CODE
001531     WHEN FCVFQTYP-DEFERRED
001532         MOVE 'DEFERRED' TO RP-QUAL-CODE
001533     WHEN FCVFQTYP-ROTH-IRA
001534         MOVE 'ROTH IRA' TO RP-QUAL-CODE
001535     WHEN FCVFQTYP-EDUCATION-IRA
001536         MOVE 'EDUCATION IRA' TO RP-QUAL-CODE
001537     WHEN FCVFQTYP-SIMPLE-IRA
001538         MOVE 'SIMPLE IRA' TO RP-QUAL-CODE
001539     WHEN FCVFQTYP-SIMPLE-401K
001540         MOVE 'SIMPLE 401K' TO RP-QUAL-CODE
001541     WHEN FCVFQTYP-ROTH-CNVRSN-IRA
001542         MOVE 'ROTH CONVERSION IRA' TO RP-QUAL-CODE
001543     WHEN FCVFQTYP-INH-IRA
001544         MOVE 'INHERITED IRA' TO RP-QUAL-CODE
001545     WHEN FCVFQTYP-PENSION-SEP
001546         MOVE 'SEP' TO RP-QUAL-CODE
001547     WHEN OTHER
001548         MOVE FCVFQTYP-ANN-QUAL TO RP-QUAL-CODE
001549 END-EVALUATE.

001550 P200-PROCESS-SEG-02-EXIT.
001551     EXIT.
001552     EJECT
001553 *******************************************************
001554 *                 GET USER INFO - 52 SEGMENT           *
001555 *******************************************************
001556 P200-PROCESS-SEG-52.
001557     MOVE +0  TO WS-SEG-SEQ.
001558     MOVE '52' TO WS-SEG-ID.

001560     PERFORM SUB7000-GET-TRLR THRU SUB7999-GET-TRLR-EXIT.
001553     PERFORM SUB7000-GET-TRLR THRU SUB7999-GET-TRLR-EXIT.

001555     IF WS-IO-CODE IS NOT EQUAL TO '0'
001556         GO TO P200-PROCESS-SEG-52-EXIT
001557     END-IF.

001559     MOVE WS-SEG-WORK-AREA TO USER-SEGMENT.

001561     MOVE FUZPERSI-PERSISTENCY-IND TO RP-PERSISTENCY-IND.

001563     CALL 'CKDCINEX' USING FUZPERDT-PERSIST-DATE
001564                           WS-ISSUE-DATE.
001565     MOVE WS-ISSUE-MM   TO RP-PERSIST-DATE(1:2)
001566     MOVE '/'           TO RP-PERSIST-DATE(3:1)
001567     MOVE WS-ISSUE-DD   TO RP-PERSIST-DATE(4:2)
001568     MOVE '/'           TO RP-PERSIST-DATE(6:1)
001569     MOVE WS-ISSUE-YYYY TO RP-PERSIST-DATE(7:4)

001571     CALL 'CKDCINEX' USING FUZINFDT-INFORCE-DATE
001572                           WS-ISSUE-DATE.
001573     MOVE WS-ISSUE-MM   TO RP-ISSUE-DATE(1:2)
001574     MOVE '/'           TO RP-ISSUE-DATE(3:1)
001575     MOVE WS-ISSUE-DD   TO RP-ISSUE-DATE(4:2)
001576     MOVE '/'           TO RP-ISSUE-DATE(6:1)
001577     MOVE WS-ISSUE-YYYY TO RP-ISSUE-DATE(7:4).

001580 P200-PROCESS-SEG-52-EXIT.
001581     EXIT.
001582 *******************************************************
001583 *               PROCESS AGENT SEGMENT - 48            *
001584 *******************************************************
001585 P300-PROCESS-SEG-48.
001586     MOVE +0  TO WS-SEG-SEQ.
001587     MOVE '48' TO WS-SEG-ID.

001589 P399-NEXT-SEG-48.
001590     PERFORM SUB7000-GET-TRLR THRU SUB7999-GET-TRLR-EXIT.

001592     IF WS-IO-CODE NOT EQUAL '0'
001593         GO TO P300-PROCESS-SEG-48-EXIT
001594     END-IF.

001596     MOVE WS-SEG-WORK-AREA TO AGENT-SEGMENT.

001598     MOVE FAGAGTID-AGENT-IDENT(1) TO WS-AGENT-CHK.

001600     IF AGENT-PRESENT
001601         MOVE FAGAGTID-AGENT-IDENT(1) TO RP-AGNT-ID
001602         COMPUTE WS-AGENT-COMM =
001603                 FAGPCTSH-PERCENT-SHARE-COMM * 100
001604         MOVE WS-AGENT-COMM TO RP-AGENT-PER
001605     ELSE
001606         GO TO P399-NEXT-SEG-48
001607     END-IF.

001609 P300-PROCESS-SEG-48-EXIT.
001610     EXIT.
001611     EJECT
001612 *******************************************************
001613 *           PROCESS LIFE CONTROL SEGMENT -- 89        *
001614 *******************************************************
001615 P400-PROCESS-SEG-89.
001616     MOVE +0  TO WS-89SEG-SEQ.
001617     MOVE '89' TO WS-89SEG-ID.
001618     MOVE +0  TO WS-89CTR.

001620 P420-PROCESS-NEXT-89.

001622     PERFORM SUB7000-GET-89TRLR THRU
001623             SUB7999-GET-89TRLR-EXIT.

001625     IF WS-IO-CODE IS NOT EQUAL TO '0'
001626         GO TO P400-PROCESS-SEG-89-EXIT
001627     END-IF.

001629     INITIALIZE WS-EXT-CEASE-DATE
001630                WS-EXT-DOD-DATE.

001632     CALL 'CKDCINEX' USING FLCCSEDT-CEASE-DATE
001633                           WS-EXT-CEASE-DATE.

001635     CALL 'CKDCINEX' USING FLCDHDAT-DATE-OF-DEATH
001636                           WS-EXT-DOD-DATE.

001638     IF WS-EXT-CEASE-DATE IS NUMERIC OR
001639        WS-EXT-DOD-DATE IS NUMERIC
001640         GO TO P420-PROCESS-NEXT-89
001641     END-IF.

001643     IF FLCPERSN-PRIMARY-INSURED
001644         IF FLCLVERN-NAME-DATA
001645             STRING FLCFNAME-FIRST-NAME DELIMITED BY ' '
001646                    FLCMINIT-MID-INITIAL DELIMITED BY ' '
001647                    FLCLNAME-LAST-NAME DELIMITED BY ' '
001648                    INTO RP-INSURED-NAME
001649             END-STRING
001650         ELSE
001651             MOVE FLCCORP-CORPORATION TO RP-INSURED-NAME
001652         END-IF
001653         INSPECT RP-INSURED-NAME REPLACING ALL ',' BY ' '
001654     END-IF.

001656     IF WS-89CTR > +05
001657         GO TO P400-PROCESS-SEG-89-EXIT
001658     END-IF.

001660     IF FLCPERSN-OWNER
001661         ADD +1 TO WS-89CTR
001662         IF FLCLVERN-NAME-DATA
001663             STRING FLCFNAME-FIRST-NAME DELIMITED BY ' '
001664                    FLCMINIT-MID-INITIAL DELIMITED BY ' '
001665                    FLCLNAME-LAST-NAME DELIMITED BY ' '
001666                    INTO RP-OWNER-NAME(WS-89CTR)
001667             END-STRING
001666         INTO RP-OWNER-NAME(WS-89CTR)
001667     END-STRING
001668 ELSE
001669     MOVE FLCCORP-CORPORATION TO RP-OWNER-NAME(WS-89CTR)
001670 END-IF.
001671 INSPECT RP-OWNER-NAME(WS-89CTR) REPLACING ALL ',' BY ' '

001673 END-IF.

001675 GO TO P420-PROCESS-NEXT-89.

001677 P400-PROCESS-SEG-89-EXIT.
001678     EXIT.
001679     EJECT
001680 *******************************************************
001681 *      THIS ROUTINE WILL GET THE 89 SEGMENT.          *
001682 *******************************************************
001683 SUB7000-GET-89TRLR.

001685     ADD +1 TO WS-89SEG-SEQ.
001686     CALL 'CKETRGET' USING WS-89SEG-ID
001687                           WS-89SEG-SEQ
001688                           INQUIRY-LIFE-CNTL-SEGMENT
001689                           WS-DUMMY
001690                           WS-IO-CODE
001691                           WS-DUMMY
001692                           INFORCE-FILE-DCB.

001694 SUB7999-GET-89TRLR-EXIT.
001695     EXIT.
001696     EJECT
001697 *******************************************************
001698 *      THIS ROUTINE WILL GET A SEGMENT.                *
001699 *******************************************************
001700 SUB7000-GET-TRLR.
001701     ADD +1 TO WS-SEG-SEQ.
001702     INITIALIZE WS-SEG-WORK-AREA.

001704     IF HISTORY-FILE
001705         CALL 'CKETRGET' USING WS-SEG-ID
001706                           WS-SEG-SEQ
001707                           WS-SEG-WORK-AREA
001708                           WS-DUMMY
001709                           WS-IO-CODE
001710                           WS-DUMMY
001711                           HISTORY-FILE-DCB
001712     END-IF.

001714     IF INFORCE-FILE
001715         CALL 'CKETRGET' USING WS-SEG-ID
001716                           WS-SEG-SEQ
001717                           WS-SEG-WORK-AREA
001718                           WS-DUMMY
001719                           WS-IO-CODE
001720                           WS-DUMMY
001721                           INFORCE-FILE-DCB
001722     END-IF.

001724 SUB7999-GET-TRLR-EXIT.
001725     EXIT.
001726     EJECT
001727 *******************************************************
001728 *              PROCESS PVE EXTRACT FILE                *
001729 *******************************************************
001730 3400-READ-PVEFILE-FILE.
001731     READ PVERESP-EXTRACT-FILE INTO WS-PVERESP-EXTRACT
001732         AT END SET END-OF-FILE-PVE TO TRUE
001733     END-READ.
001734 3499-READ-PVEFILE-EXIT.
001735     EXIT.

001737 3500-PROCESS-PVEFILE.

001739     IF END-OF-FILE-PVE
001740         GO TO 3599-PROCESS-PVEFILE-EXIT
001741     END-IF.

001743     IF PVE-CONTRACT-ID > FRCCNTRT-CONTRACT-NUMBER (1:8)
001744         GO TO 3599-PROCESS-PVEFILE-EXIT
001745     END-IF.

001747     IF PVE-CONTRACT-ID < FRCCNTRT-CONTRACT-NUMBER (1:8)
001748         PERFORM 3400-READ-PVEFILE-FILE THRU
001749                 3499-READ-PVEFILE-EXIT
001750         IF END-OF-FILE-PVE
001751             GO TO 3599-PROCESS-PVEFILE-EXIT
001752         END-IF
001753         GO TO 3500-PROCESS-PVEFILE
001754     END-IF.

001756     PERFORM 3400-READ-PVEFILE-FILE THRU
001757             3499-READ-PVEFILE-EXIT

001759     IF END-OF-FILE-PVE
001760         GO TO 3599-PROCESS-PVEFILE-EXIT
001761     END-IF.

001763     IF PVE-CALC-CD = 'TAV'
001764         MOVE PVE-CALC-VALUE TO RP-CASH-VALUE
001765     END-IF.

001767     GO TO 3500-PROCESS-PVEFILE.

001769 3599-PROCESS-PVEFILE-EXIT.
001770     EXIT.
001771 *******************************************************
001772 *                  BATCH IO ROUTINE                    *
001773 *******************************************************
001774 SUB4000-IOROUTINE.

001776     CALL 'CKBATCHC' USING BCHCODES-CALLING-FILE
001777                            BCHCODES-CALLING-RETURN
001778                            OFFLINE-RECORD
001779                            RECORD-LENGTH.

001781     IF BCHCODES-CALLING-RETURN NOT EQUAL
001782        BCHNORM-NORMAL-RETURN  AND
001783        BCHEOF-END-OF-FILE
001782     BCHNORM-NORMAL-RETURN  AND
001783     BCHEOF-END-OF-FILE
001784         DISPLAY MSG01-IO-ERROR
001785                 SPACE
001786                 BCHCODES-CALLING-FILE
001787                 SPACE
001788                 BCHCODES-CALLING-RETURN
001789         CALL 'CKCOBCLS'
001790         CALL 'CKABEND'
001791     END-IF.

001793 SUB4999-IO-ROUTINE-EXIT.
001794     EXIT.
001795     EJECT
001796 *******************************************************
001797 *                 READ ACF FILE                        *
001798 *******************************************************
001799 2200-READ-ACF.

001801     SET AGENT-NOT-ACTIVE TO TRUE.
001802     MOVE SPACE TO WS-AGENT-NAME.
001803     MOVE SPACE TO WS-AGENT-STATUS.
001804     MOVE 'E' TO WS-AGT-KEY-REC-ID.
001805     MOVE +0  TO WS-ACF-LENGTH-PARAM.
001806     MOVE HEX-00 TO WS-AGT-KEY-USER.
001807     MOVE WS-AGENT-ID TO WS-AGT-KEY-AGENT.
001808     MOVE '2' TO WS-ACF-IO-BYTE.
001809     CALL 'CKVSAMIO' USING ACF-FILE-NAME
001810                           WS-ACF-IO-BYTE
001811                           WS-ACF-AREA
001812                           WS-ACF-LENGTH-PARAM
001813                           WS-AGT-KEY.

001815     IF WS-ACF-IO-BYTE IS NOT EQUAL TO '0'
001816         DISPLAY 'ERROR IN READING ACF FILE, RC : '
001817                 WS-ACF-IO-BYTE
001818                 ' FOR AGENT : ' WS-AGENT-ID
001819         GO TO 2200-READ-ACF-EXIT
001820     END-IF.

001821     CALL 'CKETRLST' USING WS-ACF-IO-BYTE
001822                           WS-ACF-AREA
001823                           WS-ACF-DCB
001824                           CONSTANT-89
001825                           AGTMAX-RECORD
001826                           AGTTRL-TRAILERS.

001828     IF WS-ACF-IO-BYTE IS NOT EQUAL TO '0'
001829         DISPLAY 'AGENT ETRLST FAILED ' RP-POLICY ' '
001830                 WS-AGENT-ID
001831         GO TO 2200-READ-ACF-EXIT
001832     END-IF.

001834     MOVE WS-ACF-BASIC-SECTION TO AGENTS-BASIC-SECTION.

001836     IF GBSASACT-ACTIVE
001837         SET ACTV-AGNT-FOUND TO TRUE
001838         MOVE 'ACTIVE' TO WS-AGENT-STATUS
001839     END-IF.

001841     MOVE '10' TO WS-AGT-ID.
001842     MOVE +1   TO WS-AGT-SEQ.
001843     CALL 'CKETRGET' USING WS-AGT-ID
001844                           WS-AGT-SEQ
001845                           WS-SEG-WORK-AREA
001846                           WS-DUMMY
001847                           WS-IO-CODE
001848                           WS-DUMMY
001849                           WS-ACF-DCB.

001851     MOVE WS-SEG-WORK-AREA TO AGENT-NAME-SEGMENT.
001852     IF GNMSSID-SS-TID-TYPE = 'C'
001853         MOVE GNMCORP-CORPORATION TO WS-AGENT-NAME
001854     ELSE
001855         STRING GNMLNAME-LAST-NAME DELIMITED BY ' '
001856                ', '
001857                GNMFNAME-FIRST-NAME DELIMITED BY ' '
001858                INTO WS-AGENT-NAME
001859     END-IF.

001860 2200-READ-ACF-EXIT.
001861     EXIT.
001862     EJECT

